# pandas
* [https://pandas.pydata.org/docs/getting_started/index.html](https://pandas.pydata.org/docs/getting_started/index.html)
* numpy를 내부적으로 활용함
* 데이터 분석에 특화된 데이터 구조를 제공 (DataFrame, Series)
* 다양한 데이터 분석 함수를 제공
* 데이터베이스에 쉽게 연결이 가능
* json, html의 table 요소를 DataFrame으로 쉽게 변경 가능

In [267]:
# !pip install pandas

# pandas에서 다루는 데이터 타입 2가지
## 1) DataFrame: 2차원의 표 형식 데이터
* python의 dict와도 비슷
* 하나의 key에 list형태의 value가 매칭되어 있는 형태
```python
{key1 : [value1, value2, value3], key2 :[value1, value2, value3]}
```
## 2) Series: 1차원의 벡터 형식 데이터
* python의 list, tuple, numpy의 ndarray와 비슷
* 이름이 있는 list

In [268]:
import pandas as pd

In [269]:
import numpy as np

# 데이터프레임 만들기
```python
pd.DataFrame(
    {'이름' : ['홍길동', '둘리', '또치', '도우너'],
     '주소' : ['서울', '의정부', '고양', '성남'],
     '취미' : ['음악감상', '놀기', '달리기', '바이올린']
    })
```

In [270]:
df = pd.DataFrame(
    {'이름' : ['홍길동', '둘리', '또치', '도우너'],
     '주소' : ['서울', '의정부', '고양', '성남'],
     '취미' : ['음악감상', '놀기', '달리기', '바이올린']
    })
df

    이름   주소    취미
0  홍길동   서울  음악감상
1   둘리  의정부    놀기
2   또치   고양   달리기
3  도우너   성남  바이올린

In [271]:
df['이름'][0:3]

0    홍길동
1     둘리
2     또치
Name: 이름, dtype: str

In [272]:
df.shape # 행 4개, 열 3개

(4, 3)

In [273]:
df.ndim # 몇차원인지

2

In [274]:
df.size # 요소 개수

12

In [275]:
df['이름'].dtype # 'O' => Object라는 뜻

# Series 만들기
```python
pd.Series([리스트/튜플], name='컬럼명')
```
* 이름을 가지고 있는 list/ 벡터
* DataFrame에서 컬럼 1개를 잘라온 상태
* 세로 출력

In [276]:
ages = pd.Series([22,53,35], name='나이')
ages

0    22
1    53
2    35
Name: 나이, dtype: int64

In [277]:
ages[0]

np.int64(22)

In [278]:
ages[::-1]

2    35
1    53
0    22
Name: 나이, dtype: int64

In [279]:
ages[0:2:2] # [시작: 끝+1 : step]

0    22
Name: 나이, dtype: int64

In [280]:
ages.min()

np.int64(22)

In [281]:
ages.max()

np.int64(53)

In [282]:
ages.sum()

np.int64(110)

In [283]:
ages.cumsum()

0     22
1     75
2    110
Name: 나이, dtype: int64

In [284]:
ages.mean()

np.float64(36.666666666666664)

In [285]:
ages.median()

np.float64(35.0)

# 판다스에서 자료 불러오기, 저장하기
* csv, tsv, excel, json, html, sql
* pd.read_확장자명 (파일경로, 옵션)

* excel 파일 불러오기

In [286]:
# !pip install openpyxl

In [287]:
%%time
df_excel = pd.read_excel("./data/Online Retail.xlsx")
df_excel

CPU times: total: 1min 7s
Wall time: 1min 8s

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

* csv 파일 불러오기

In [288]:
%%time
df_csv = pd.read_csv("./data/Online Retail.csv")
df_csv

CPU times: total: 703 ms
Wall time: 767 ms

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [289]:
%%time
df_excel2 = pd.read_excel("./data/아파트(매매)_실거래가_20240806113828.xlsx")
df_excel2

C:\Users\Admin\miniforge3\envs\fintech\Lib\site-packages\openpyxl\styles\stylesheet.py:237: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

CPU times: total: 20.6 s
Wall time: 20.9 s

,□ 본 서비스에서 제공하는 정보는 법적인 효력이 없으므로 참고용으로만 활용하시기 바랍니다.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20
0,"□ 신고정보가 실시간 변경, 해제되어 제공시점에 따라 공개건수 및 내용이 상이할 수...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"□ 본 자료는 계약일 기준입니다. (※ 7월 계약, 8월 신고건 → 7월 거래건으로...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"□ 통계자료 활용시에는 수치가 왜곡될 수 있으니 참고자료로만 활용하시기 바라며, ...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,* 국토교통부 실거래가 공개시스템의 궁금하신 점이나 문의사항은 콜센터 1533-29...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37587,37576,서울특별시 송파구 장지동,849,0849,0000,송파파인타운3단지,84.9800,202407,01,"117,500",...,14,개인,개인,2008,충민로 152,-,중개거래,서울 송파구,-,아파트
37588,37577,부산광역시 사상구 모라동,552,0552,0000,백양그린,41.3000,202407,01,"7,000",...,8,개인,개인,1992,모라로110번길 88,-,중개거래,부산 사상구,24.07.10,아파트
37589,37578,광주광역시 광산구 비아동,152-5,0152,0005,호반,59.8800,202407,01,"15,400",...,5,개인,개인,1998,비아로 185,-,중개거래,광주 광산구,24.07.26,아파트
37590,37579,부산광역시 사상구 모라동,552,0552,0000,백양그린,41.3000,202407,01,"7,500",...,10,개인,개인,1992,모라로110번길 88,-,중개거래,부산 사상구,24.07.19,아파트
37591,37580,대구광역시 북구 읍내동,1366-2,1366,0002,칠곡보성,84.9800,202407,01,"21,000",...,9,개인,개인,1992,구암로21길 26,-,중개거래,대구 북구,-,아파트

In [290]:
df_excel2.to_csv("./data/아파트(매매)_실거래가_20240806113828.csv", index=False, encoding="utf-8-sig")

In [291]:
%%time
df_csv2 = pd.read_csv("./data/아파트(매매)_실거래가_20240806113828.csv")
df_csv2

CPU times: total: 188 ms
Wall time: 228 ms

<timed exec>:1: DtypeWarning: Columns (0: □ 본 서비스에서 제공하는 정보는 법적인 효력이 없으므로 참고용으로만 활용하시기 바랍니다., 1: Unnamed: 3, 2: Unnamed: 4, 3: Unnamed: 6, 4: Unnamed: 7, 5: Unnamed: 8, 6: Unnamed: 11, 7: Unnamed: 14) have mixed types. Specify dtype option on import or set low_memory=False.

,□ 본 서비스에서 제공하는 정보는 법적인 효력이 없으므로 참고용으로만 활용하시기 바랍니다.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20
0,"□ 신고정보가 실시간 변경, 해제되어 제공시점에 따라 공개건수 및 내용이 상이할 수...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"□ 본 자료는 계약일 기준입니다. (※ 7월 계약, 8월 신고건 → 7월 거래건으로...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"□ 통계자료 활용시에는 수치가 왜곡될 수 있으니 참고자료로만 활용하시기 바라며, ...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,* 국토교통부 실거래가 공개시스템의 궁금하신 점이나 문의사항은 콜센터 1533-29...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37587,37576,서울특별시 송파구 장지동,849,849,0,송파파인타운3단지,84.98,202407,1,"117,500",...,14,개인,개인,2008,충민로 152,-,중개거래,서울 송파구,-,아파트
37588,37577,부산광역시 사상구 모라동,552,552,0,백양그린,41.3,202407,1,"7,000",...,8,개인,개인,1992,모라로110번길 88,-,중개거래,부산 사상구,24.07.10,아파트
37589,37578,광주광역시 광산구 비아동,152-5,152,5,호반,59.88,202407,1,"15,400",...,5,개인,개인,1998,비아로 185,-,중개거래,광주 광산구,24.07.26,아파트
37590,37579,부산광역시 사상구 모라동,552,552,0,백양그린,41.3,202407,1,"7,500",...,10,개인,개인,1992,모라로110번길 88,-,중개거래,부산 사상구,24.07.19,아파트
37591,37580,대구광역시 북구 읍내동,1366-2,1366,2,칠곡보성,84.98,202407,1,"21,000",...,9,개인,개인,1992,구암로21길 26,-,중개거래,대구 북구,-,아파트

In [292]:
df_json = pd.read_json("./data/서울특별시_관광지입장정보_2011_2016 (1).json")
df_json

    ForNum  NatNum  addrCd gungu      resNm  rnum   sido  yyyymm
0    44722   75991    1111   종로구        창덕궁     1  서울특별시  201112
1        0   11017    1111   종로구        운현궁     2  서울특별시  201112
2   132399  237330    1111   종로구        경복궁     3  서울특별시  201112
3     3133   21267    1111   종로구        창경궁     4  서울특별시  201112
4    18226   24223    1111   종로구         종묘     5  서울특별시  201112
..     ...     ...     ...   ...        ...   ...    ...     ...
62    5588   44232    1141  서대문구  서대문형무소역사관     8  서울특별시  201512
63       0   22587    1141  서대문구  서대문자연사박물관     9  서울특별시  201512
64   29520    8822    1144   마포구    트릭아이미술관    10  서울특별시  201512
65       3    1647    1165   서초구      헌릉ㆍ인릉    11  서울특별시  201512
66     492   14454    1168   강남구      선릉·정릉    12  서울특별시  201512

[67 rows x 8 columns]

In [293]:
df_json2 = pd.read_json("../03python/data/전국치킨집리스트.json")
df_json2

,header,body
0,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '10027626', 'bizesNm': ..."
1,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '11927910', 'bizesNm': ..."
2,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '12078226', 'bizesNm': ..."
3,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '12448225', 'bizesNm': ..."
4,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '12601898', 'bizesNm': ..."
5,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '15841722', 'bizesNm': ..."
6,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '16099079', 'bizesNm': ..."
7,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '16280562', 'bizesNm': ..."
8,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '16484714', 'bizesNm': ..."
9,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '16604739', 'bizesNm': ..."
10,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '16728435', 'bizesNm': ..."
11,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17014298', 'bizesNm': ..."
12,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17142954', 'bizesNm': ..."
13,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17430609', 'bizesNm': ..."
14,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17504547', 'bizesNm': ..."
15,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17616920', 'bizesNm': ..."
16,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17847228', 'bizesNm': ..."
17,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17915858', 'bizesNm': ..."
18,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '18114669', 'bizesNm': ..."
19,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '18354009', 'bizesNm': ..."
20,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '19991844', 'bizesNm': ..."
21,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '20158282', 'bizesNm': ..."
22,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '20304765', 'bizesNm': ..."
23,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '20450480', 'bizesNm': ..."
24,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '20609325', 'bizesNm': ..."
25,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '21867919', 'bizesNm': ..."
26,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '22092363', 'bizesNm': ..."
27,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '23180454', 'bizesNm': ..."
28,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '23395927', 'bizesNm': ..."
29,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '25259031', 'bizesNm': ..."
30,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '25551235', 'bizesNm': ..."
31,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '25789400', 'bizesNm': ..."
32,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '26069091', 'bizesNm': ..."
33,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '26205307', 'bizesNm': ..."
34,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '26205307', 'bizesNm': ..."
35,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '28488294', 'bizesNm': ..."
36,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '9148230', 'bizesNm': '..."

In [294]:
import json
with open("../03python/data/전국치킨집리스트.json") as f:
    df_json3 = f.read()
    df_json3 = json.loads(df_json3)

In [295]:
df_json3[0]['body']['items'][0]

{'bizesId': '10027626',
 'bizesNm': '장모님치킨가창점',
 'brchNm': '가창점',
 'indsLclsCd': 'Q',
 'indsLclsNm': '음식',
 'indsMclsCd': 'Q05',
 'indsMclsNm': '닭/오리요리',
 'indsSclsCd': 'Q05A08',
 'indsSclsNm': '후라이드/양념치킨',
 'ksicCd': 'I56193',
 'ksicNm': '치킨 전문점',
 'ctprvnCd': '27',
 'ctprvnNm': '대구광역시',
 'signguCd': '27710',
 'signguNm': '달성군',
 'adongCd': '2771031000',
 'adongNm': '가창면',
 'ldongCd': '2771031024',
 'ldongNm': '가창면',
 'lnoCd': '2771031024101200001',
 'plotSctCd': '1',
 'plotSctNm': '대지',
 'lnoMnno': 120,
 'lnoSlno': 1,
 'lnoAdr': '대구광역시 달성군 가창면 냉천리 120-1',
 'rdnmCd': '277103148001',
 'rdnm': '대구광역시 달성군 가창면 가창동로',
 'bldMnno': 6,
 'bldSlno': '',
 'bldMngNo': '2771031024101200004036858',
 'bldNm': '',
 'rdnmAdr': '대구광역시 달성군 가창면 가창동로 6',
 'oldZipcd': '711861',
 'newZipcd': '42938',
 'dongNo': '',
 'flrNo': '1',
 'hoNo': '',
 'lon': 128.644458591419,
 'lat': 35.7826625402814}

In [296]:
result = []
for page in df_json3:
    temp_df = pd.json_normalize(df_json3[0]['body']['items'])
    result.append(temp_df)
final_result = pd.concat(result)
final_result

,bizesId,bizesNm,brchNm,indsLclsCd,indsLclsNm,indsMclsCd,indsMclsNm,indsSclsCd,indsSclsNm,ksicCd,...,bldMngNo,bldNm,rdnmAdr,oldZipcd,newZipcd,dongNo,flrNo,hoNo,lon,lat
0,10027626,장모님치킨가창점,가창점,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,2771031024101200004036858,,대구광역시 달성군 가창면 가창동로 6,711861,42938,,1,,128.644459,35.782663
1,10098244,짱구피자치킨,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4125010300102680011008557,,경기도 동두천시 못골로 30,483030,11320,,,,127.065903,37.901262
2,10099459,쭈노치킨,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4157025324105380008019970,,경기도 김포시 고촌읍 장차로13번길 18,415811,10126,,1,,126.769859,37.603752
3,10136167,치킨뱅이,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4213011000108300006022278,,강원도 원주시 금불3길 5,220938,26423,,1,,127.932025,37.348358
4,10136346,치킨월드율량점,율량점,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4311111500108060000045239,,충청북도 청주시 청원구 공항로138번길 53,363818,28328,,1,,127.487586,36.669816
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,11927120,두두두마리치킨,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4719034028104640013062144,,경상북도 구미시 해평면 강동로 1671,730873,39154,,1,,128.390989,36.199637
996,11927310,호식이두마리치킨,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4272025029104520007040192,,강원도 홍천군 홍천읍 남산강변로 32,250930,25149,,1,,127.882012,37.685865
997,11927491,또봉이치킨,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,2820010200100690027020930,,인천광역시 남동구 풀무로 9-2,405230,21510,,1,,126.709187,37.469419
998,11927616,투마리치킨하늘도시점,하늘도시점,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,2811014600100330008000001,,인천광역시 중구 운중로 85-1,400811,22359,,1,,126.542880,37.493596
999,11927757,노랑통닭,구리수택점,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4131010500104480006008791,구리신성미소지움,경기도 구리시 이문안로 81,471030,11941,101,1,,127.140380,37.592408

In [297]:
df_json2 = pd.read_json("../03python/data/전국치킨집리스트.json")
df_json2

,header,body
0,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '10027626', 'bizesNm': ..."
1,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '11927910', 'bizesNm': ..."
2,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '12078226', 'bizesNm': ..."
3,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '12448225', 'bizesNm': ..."
4,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '12601898', 'bizesNm': ..."
5,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '15841722', 'bizesNm': ..."
6,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '16099079', 'bizesNm': ..."
7,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '16280562', 'bizesNm': ..."
8,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '16484714', 'bizesNm': ..."
9,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '16604739', 'bizesNm': ..."
10,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '16728435', 'bizesNm': ..."
11,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17014298', 'bizesNm': ..."
12,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17142954', 'bizesNm': ..."
13,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17430609', 'bizesNm': ..."
14,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17504547', 'bizesNm': ..."
15,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17616920', 'bizesNm': ..."
16,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17847228', 'bizesNm': ..."
17,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '17915858', 'bizesNm': ..."
18,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '18114669', 'bizesNm': ..."
19,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '18354009', 'bizesNm': ..."
20,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '19991844', 'bizesNm': ..."
21,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '20158282', 'bizesNm': ..."
22,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '20304765', 'bizesNm': ..."
23,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '20450480', 'bizesNm': ..."
24,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '20609325', 'bizesNm': ..."
25,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '21867919', 'bizesNm': ..."
26,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '22092363', 'bizesNm': ..."
27,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '23180454', 'bizesNm': ..."
28,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '23395927', 'bizesNm': ..."
29,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '25259031', 'bizesNm': ..."
30,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '25551235', 'bizesNm': ..."
31,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '25789400', 'bizesNm': ..."
32,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '26069091', 'bizesNm': ..."
33,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '26205307', 'bizesNm': ..."
34,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '26205307', 'bizesNm': ..."
35,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '28488294', 'bizesNm': ..."
36,"{'description': '소상공인시장진흥공단 주요상권내 상가업소정보', 'co...","{'items': [{'bizesId': '9148230', 'bizesNm': '..."

In [298]:
df_json2 = pd.json_normalize(df_json3[0]['body']['items'])
df_json2

,bizesId,bizesNm,brchNm,indsLclsCd,indsLclsNm,indsMclsCd,indsMclsNm,indsSclsCd,indsSclsNm,ksicCd,...,bldMngNo,bldNm,rdnmAdr,oldZipcd,newZipcd,dongNo,flrNo,hoNo,lon,lat
0,10027626,장모님치킨가창점,가창점,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,2771031024101200004036858,,대구광역시 달성군 가창면 가창동로 6,711861,42938,,1,,128.644459,35.782663
1,10098244,짱구피자치킨,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4125010300102680011008557,,경기도 동두천시 못골로 30,483030,11320,,,,127.065903,37.901262
2,10099459,쭈노치킨,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4157025324105380008019970,,경기도 김포시 고촌읍 장차로13번길 18,415811,10126,,1,,126.769859,37.603752
3,10136167,치킨뱅이,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4213011000108300006022278,,강원도 원주시 금불3길 5,220938,26423,,1,,127.932025,37.348358
4,10136346,치킨월드율량점,율량점,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4311111500108060000045239,,충청북도 청주시 청원구 공항로138번길 53,363818,28328,,1,,127.487586,36.669816
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,11927120,두두두마리치킨,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4719034028104640013062144,,경상북도 구미시 해평면 강동로 1671,730873,39154,,1,,128.390989,36.199637
996,11927310,호식이두마리치킨,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4272025029104520007040192,,강원도 홍천군 홍천읍 남산강변로 32,250930,25149,,1,,127.882012,37.685865
997,11927491,또봉이치킨,,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,2820010200100690027020930,,인천광역시 남동구 풀무로 9-2,405230,21510,,1,,126.709187,37.469419
998,11927616,투마리치킨하늘도시점,하늘도시점,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,2811014600100330008000001,,인천광역시 중구 운중로 85-1,400811,22359,,1,,126.542880,37.493596
999,11927757,노랑통닭,구리수택점,Q,음식,Q05,닭/오리요리,Q05A08,후라이드/양념치킨,I56193,...,4131010500104480006008791,구리신성미소지움,경기도 구리시 이문안로 81,471030,11941,101,1,,127.140380,37.592408

In [299]:
df_html = pd.read_html("./data/corpList.htm")
df_html[0]

ImportError: `Import lxml` failed.  Use pip or conda to install the lxml package.

# DB에서 자료 읽어오기

In [ ]:
import os
from dotenv import load_dotenv
load_dotenv("../05data_scraping/.env")

In [ ]:
dbid = os.getenv("dbid")
dbpw = os.getenv("dbpw")
host = os.getenv("host")
port = os.getenv("port")

In [ ]:
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [ ]:
engine = create_engine(f"mysql+pymysql://{dbid}:{dbpw}@{host}:{port}/exchange_rate_data")
conn = engine.connect()
df_sql= pd.read_sql("exchange_rate", con=conn)
conn.close()
df_sql

In [ ]:
from dbio import from_db

In [ ]:
df_sql2 = from_db("exchange_rate_data", "exchange_rate")
df_sql2

# 타이타닉 데이터셋으로 pandas 기능 익히기

In [300]:
df = pd.read_csv("./data/Titanic_train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [301]:
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [302]:
display(df)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## 데이터 일부만 보기
* head(숫자), tail(숫자)
* 기본값을 5개 행만 출력
* 60행까지 출력 가능

In [303]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [304]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [305]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [306]:
df.head(60) # 61개로 넘어가는 순간 ...으로 생략이 됨

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
37,38,0,3,"Cann, Mr. Ernest Charles",male,21.0,0,0,A./5. 2152,8.0500,NaN,S
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,345764,18.0000,NaN,S
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,1,0,11668,21.0000,NaN,S
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.0,1,2,SC/Paris 2123,41.5792,NaN,C
44,45,1,3,"Devaney, Miss. Margaret Delia",female,19.0,0,0,330958,7.8792,NaN,Q
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,14311,7.7500,NaN,Q
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
49,50,0,3,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",female,18.0,1,0,349237,17.8000,NaN,S
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S
51,52,0,3,"Nosworthy, Mr. Richard Cater",male,21.0,0,0,A/4. 39886,7.8000,NaN,S
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
53,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29.0,1,0,2926,26.0000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
56,57,1,2,"Rugg, Miss. Emily",female,21.0,0,0,C.A. 31026,10.5000,NaN,S
57,58,0,3,"Novel, Mr. Mansouer",male,28.5,0,0,2697,7.2292,NaN,C
58,59,1,2,"West, Miss. Constance Mirium",female,5.0,1,2,C.A. 34651,27.7500,NaN,S
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S

# .info()
* 컬럼명, null이 아닌 데이터 개수와 데이터 타입을 동시에 출력

In [307]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    str
 4   Sex          891 non-null    str
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    str
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    str
 11  Embarked     889 non-null    str
dtypes: float64(2), int64(5), str(5)
memory usage: 83.7 KB

# .describe()
* 데이터 프레임의 숫자 데이터의 기초통계를 보여주는 함수
* count, mean, std, min, 25%, 50%, 75%, max
* .describe(include="all"): 문자형/카테고리형 데이터에서 유일값, 최빈값 출력

In [308]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [309]:
df.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,G6,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

# Pandas 데이터 프레임에서 일부 자료만 추출하기
* 데이터 프레임에서 1개 컬럼만 가져오기

In [310]:
print(df['Name'], type(df['Name']))
print(df['Name'].shape, df['Name'].ndim) # 1차원 벡터구나 !

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: str <class 'pandas.Series'>
(891,) 1

In [311]:
display(df[['Name']])# 대괄호 하나 더 쳐주면 df형태로 나옴 (2차원인 행 벡터)
print(df[['Name']].ndim, df[['Name']].shape)

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

2 (891, 1)

* 2개 이상 컬럼을 가져오기

In [312]:
df[['Age', 'Name', 'Cabin']]

      Age                                               Name Cabin
0    22.0                            Braund, Mr. Owen Harris   NaN
1    38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...   C85
2    26.0                             Heikkinen, Miss. Laina   NaN
3    35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)  C123
4    35.0                           Allen, Mr. William Henry   NaN
..    ...                                                ...   ...
886  27.0                              Montvila, Rev. Juozas   NaN
887  19.0                       Graham, Miss. Margaret Edith   B42
888   NaN           Johnston, Miss. Catherine Helen "Carrie"   NaN
889  26.0                              Behr, Mr. Karl Howell  C148
890  32.0                                Dooley, Mr. Patrick   NaN

[891 rows x 3 columns]

In [313]:
df[[ 'Cabin', 'Age', 'Name']]  # 내가 적은 순서대로 df 가져올 수 있음 (컬럼 위치 변경 가능)

    Cabin   Age                                               Name
0     NaN  22.0                            Braund, Mr. Owen Harris
1     C85  38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2     NaN  26.0                             Heikkinen, Miss. Laina
3    C123  35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4     NaN  35.0                           Allen, Mr. William Henry
..    ...   ...                                                ...
886   NaN  27.0                              Montvila, Rev. Juozas
887   B42  19.0                       Graham, Miss. Margaret Edith
888   NaN   NaN           Johnston, Miss. Catherine Helen "Carrie"
889  C148  26.0                              Behr, Mr. Karl Howell
890   NaN  32.0                                Dooley, Mr. Patrick

[891 rows x 3 columns]

# 컬럼명 출력하기: .columns

In [314]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

In [315]:
type(df.columns) # list 아니고 index라는 자료형

pandas.Index

# 데이터 프레임에서 일부 컬럼만 가져오기2
* loc: 인덱스 이름과 컬럼명으로 데이터의 일부를 추출해서 가져옴
```python
df.loc[시작row인덱스이름:끝row인덱스이름, ['컬럼명1', '컬럼명2']]
```
* iloc: 인덱스 번호를 이용해 슬라이싱으로 데이터의 일부를 가져옴
```python
df.iloc[시작row인덱스번호:끝row인덱스번호+1,시작column인덱스번호:끝column인덱스번호+1]
```

In [316]:
df[['Name', 'Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

* 이름과 나이 컬럼에서 인덱스 100~150번까지만 가져오고 싶을 때

In [317]:
df.loc[100:150,['Name', 'Age']]

                                                  Name   Age
100                            Petranec, Miss. Matilda  28.0
101                   Petroff, Mr. Pastcho ("Pentcho")   NaN
102                          White, Mr. Richard Frasar  21.0
103                         Johansson, Mr. Gustaf Joel  33.0
104                     Gustafsson, Mr. Anders Vilhelm  37.0
105                              Mionoff, Mr. Stoytcho  28.0
106                   Salkjelsvik, Miss. Anna Kristine  21.0
107                             Moss, Mr. Albert Johan   NaN
108                                    Rekic, Mr. Tido  38.0
109                                Moran, Miss. Bertha   NaN
110                     Porter, Mr. Walter Chamberlain  47.0
111                               Zabour, Miss. Hileni  14.5
112                             Barton, Mr. David John  22.0
113                            Jussila, Miss. Katriina  20.0
114                              Attalah, Miss. Malake  17.0
115                              Pekoniemi, Mr. Edvard  21.0
116                               Connors, Mr. Patrick  70.5
117                    Turpin, Mr. William John Robert  29.0
118                           Baxter, Mr. Quigg Edmond  24.0
119                  Andersson, Miss. Ellis Anna Maria   2.0
120                        Hickman, Mr. Stanley George  21.0
121                         Moore, Mr. Leonard Charles   NaN
122                               Nasser, Mr. Nicholas  32.5
123                                Webber, Miss. Susan  32.5
124                        White, Mr. Percival Wayland  54.0
125                       Nicola-Yarred, Master. Elias  12.0
126                                McMahon, Mr. Martin   NaN
127                          Madsen, Mr. Fridtjof Arne  24.0
128                                  Peter, Miss. Anna   NaN
129                                 Ekstrom, Mr. Johan  45.0
130                               Drazenoic, Mr. Jozef  33.0
131                     Coelho, Mr. Domingos Fernandeo  20.0
132     Robins, Mrs. Alexander A (Grace Charity Laury)  47.0
133      Weisz, Mrs. Leopold (Mathilde Francoise Pede)  29.0
134                     Sobey, Mr. Samuel James Hayden  25.0
135                                 Richard, Mr. Emile  23.0
136                       Newsom, Miss. Helen Monypeny  19.0
137                        Futrelle, Mr. Jacques Heath  37.0
138                                Osen, Mr. Olaf Elon  16.0
139                                 Giglio, Mr. Victor  24.0
140                      Boulos, Mrs. Joseph (Sultana)   NaN
141                           Nysten, Miss. Anna Sofia  22.0
142  Hakkarainen, Mrs. Pekka Pietari (Elin Matilda ...  24.0
143                                Burke, Mr. Jeremiah  19.0
144                         Andrew, Mr. Edgardo Samuel  18.0
145                       Nicholls, Mr. Joseph Charles  19.0
146       Andersson, Mr. August Edvard ("Wennerstrom")  27.0
147                   Ford, Miss. Robina Maggie "Ruby"   9.0
148           Navratil, Mr. Michel ("Louis M Hoffman")  36.5
149                  Byles, Rev. Thomas Roussel Davids  42.0
150                         Bateman, Rev. Robert James  51.0

In [318]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [319]:
df.iloc[100:151,3:6]   # 150까지 가져오려면 151을 써야 함. 연속되어있으면 3:6 으로 표현 가능

                                                  Name     Sex   Age
100                            Petranec, Miss. Matilda  female  28.0
101                   Petroff, Mr. Pastcho ("Pentcho")    male   NaN
102                          White, Mr. Richard Frasar    male  21.0
103                         Johansson, Mr. Gustaf Joel    male  33.0
104                     Gustafsson, Mr. Anders Vilhelm    male  37.0
105                              Mionoff, Mr. Stoytcho    male  28.0
106                   Salkjelsvik, Miss. Anna Kristine  female  21.0
107                             Moss, Mr. Albert Johan    male   NaN
108                                    Rekic, Mr. Tido    male  38.0
109                                Moran, Miss. Bertha  female   NaN
110                     Porter, Mr. Walter Chamberlain    male  47.0
111                               Zabour, Miss. Hileni  female  14.5
112                             Barton, Mr. David John    male  22.0
113                            Jussila, Miss. Katriina  female  20.0
114                              Attalah, Miss. Malake  female  17.0
115                              Pekoniemi, Mr. Edvard    male  21.0
116                               Connors, Mr. Patrick    male  70.5
117                    Turpin, Mr. William John Robert    male  29.0
118                           Baxter, Mr. Quigg Edmond    male  24.0
119                  Andersson, Miss. Ellis Anna Maria  female   2.0
120                        Hickman, Mr. Stanley George    male  21.0
121                         Moore, Mr. Leonard Charles    male   NaN
122                               Nasser, Mr. Nicholas    male  32.5
123                                Webber, Miss. Susan  female  32.5
124                        White, Mr. Percival Wayland    male  54.0
125                       Nicola-Yarred, Master. Elias    male  12.0
126                                McMahon, Mr. Martin    male   NaN
127                          Madsen, Mr. Fridtjof Arne    male  24.0
128                                  Peter, Miss. Anna  female   NaN
129                                 Ekstrom, Mr. Johan    male  45.0
130                               Drazenoic, Mr. Jozef    male  33.0
131                     Coelho, Mr. Domingos Fernandeo    male  20.0
132     Robins, Mrs. Alexander A (Grace Charity Laury)  female  47.0
133      Weisz, Mrs. Leopold (Mathilde Francoise Pede)  female  29.0
134                     Sobey, Mr. Samuel James Hayden    male  25.0
135                                 Richard, Mr. Emile    male  23.0
136                       Newsom, Miss. Helen Monypeny  female  19.0
137                        Futrelle, Mr. Jacques Heath    male  37.0
138                                Osen, Mr. Olaf Elon    male  16.0
139                                 Giglio, Mr. Victor    male  24.0
140                      Boulos, Mrs. Joseph (Sultana)  female   NaN
141                           Nysten, Miss. Anna Sofia  female  22.0
142  Hakkarainen, Mrs. Pekka Pietari (Elin Matilda ...  female  24.0
143                                Burke, Mr. Jeremiah    male  19.0
144                         Andrew, Mr. Edgardo Samuel    male  18.0
145                       Nicholls, Mr. Joseph Charles    male  19.0
146       Andersson, Mr. August Edvard ("Wennerstrom")    male  27.0
147                   Ford, Miss. Robina Maggie "Ruby"  female   9.0
148           Navratil, Mr. Michel ("Louis M Hoffman")    male  36.5
149                  Byles, Rev. Thomas Roussel Davids    male  42.0
150                         Bateman, Rev. Robert James    male  51.0

In [320]:
df.iloc[100:151,[3,5]]  # 따로따로 가져오고 싶으면 [3,5]로 표현 가능

                                                  Name   Age
100                            Petranec, Miss. Matilda  28.0
101                   Petroff, Mr. Pastcho ("Pentcho")   NaN
102                          White, Mr. Richard Frasar  21.0
103                         Johansson, Mr. Gustaf Joel  33.0
104                     Gustafsson, Mr. Anders Vilhelm  37.0
105                              Mionoff, Mr. Stoytcho  28.0
106                   Salkjelsvik, Miss. Anna Kristine  21.0
107                             Moss, Mr. Albert Johan   NaN
108                                    Rekic, Mr. Tido  38.0
109                                Moran, Miss. Bertha   NaN
110                     Porter, Mr. Walter Chamberlain  47.0
111                               Zabour, Miss. Hileni  14.5
112                             Barton, Mr. David John  22.0
113                            Jussila, Miss. Katriina  20.0
114                              Attalah, Miss. Malake  17.0
115                              Pekoniemi, Mr. Edvard  21.0
116                               Connors, Mr. Patrick  70.5
117                    Turpin, Mr. William John Robert  29.0
118                           Baxter, Mr. Quigg Edmond  24.0
119                  Andersson, Miss. Ellis Anna Maria   2.0
120                        Hickman, Mr. Stanley George  21.0
121                         Moore, Mr. Leonard Charles   NaN
122                               Nasser, Mr. Nicholas  32.5
123                                Webber, Miss. Susan  32.5
124                        White, Mr. Percival Wayland  54.0
125                       Nicola-Yarred, Master. Elias  12.0
126                                McMahon, Mr. Martin   NaN
127                          Madsen, Mr. Fridtjof Arne  24.0
128                                  Peter, Miss. Anna   NaN
129                                 Ekstrom, Mr. Johan  45.0
130                               Drazenoic, Mr. Jozef  33.0
131                     Coelho, Mr. Domingos Fernandeo  20.0
132     Robins, Mrs. Alexander A (Grace Charity Laury)  47.0
133      Weisz, Mrs. Leopold (Mathilde Francoise Pede)  29.0
134                     Sobey, Mr. Samuel James Hayden  25.0
135                                 Richard, Mr. Emile  23.0
136                       Newsom, Miss. Helen Monypeny  19.0
137                        Futrelle, Mr. Jacques Heath  37.0
138                                Osen, Mr. Olaf Elon  16.0
139                                 Giglio, Mr. Victor  24.0
140                      Boulos, Mrs. Joseph (Sultana)   NaN
141                           Nysten, Miss. Anna Sofia  22.0
142  Hakkarainen, Mrs. Pekka Pietari (Elin Matilda ...  24.0
143                                Burke, Mr. Jeremiah  19.0
144                         Andrew, Mr. Edgardo Samuel  18.0
145                       Nicholls, Mr. Joseph Charles  19.0
146       Andersson, Mr. August Edvard ("Wennerstrom")  27.0
147                   Ford, Miss. Robina Maggie "Ruby"   9.0
148           Navratil, Mr. Michel ("Louis M Hoffman")  36.5
149                  Byles, Rev. Thomas Roussel Davids  42.0
150                         Bateman, Rev. Robert James  51.0

# 특정 컬럼에서 유일값, 유일값의 수 출력하기
* unique(): 유일값만 출력
* nunique(): 유일값의 개수만 출력

In [321]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

In [322]:
df['Pclass'].unique()

array([3, 1, 2])

In [323]:
df['Pclass'].nunique()

3

In [324]:
df['Embarked'].unique()

<StringArray>
['S', 'C', 'Q', nan]
Length: 4, dtype: str

In [325]:
df['Embarked'].nunique() # 결측값은 무시하고 결과 출력됨

3

# 카테고리 컬럼에서 유일값별 개수를 세는 함수
* value_counts()

In [326]:
df['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

# 데이터를 정렬하는 함수
* sort_values(by="컬럼명")

In [327]:
df.sort_values(by="Pclass", ascending=False) # 내림차순 정렬

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
853,854,1,1,"Lines, Miss. Mary Conover",female,16.0,0,1,PC 17592,39.4000,D28,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C

* 정렬기준을 2개 컬럼 이상으로 하고 싶을 때

In [328]:
df.sort_values(by=['Pclass', 'Age'], ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
766,767,0,1,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C
793,794,0,1,"Hoyt, Mr. William Fisher",male,NaN,0,0,PC 17600,30.6958,NaN,C
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,17453,89.1042,C92,C

# 컬럼을 인덱스로 지정하기
* set_index("컬럼명")

In [329]:
df= df.set_index("PassengerId") # 재할당해줘야지 바뀜
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

* 2개 이상의 컬럼을 인덱스로 지정 (멀티인덱스)

In [330]:
df2=df.set_index(['PassengerId', 'Name'])
df2

KeyError: "None of ['PassengerId'] are in the columns"

In [331]:
df2.index

MultiIndex([(  1,                             'Braund, Mr. Owen Harris'),
            (  2, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'),
            (  3,                              'Heikkinen, Miss. Laina'),
            (  4,        'Futrelle, Mrs. Jacques Heath (Lily May Peel)'),
            (  5,                            'Allen, Mr. William Henry'),
            (  6,                                    'Moran, Mr. James'),
            (  7,                             'McCarthy, Mr. Timothy J'),
            (  8,                      'Palsson, Master. Gosta Leonard'),
            (  9,   'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)'),
            ( 10,                 'Nasser, Mrs. Nicholas (Adele Achem)'),
            ...
            (882,                                  'Markun, Mr. Johann'),
            (883,                        'Dahlberg, Miss. Gerda Ulrika'),
            (884,                       'Banfield, Mr. Frederick James'),
            (885,                              'Sutehall, Mr. Henry Jr'),
            (886,                'Rice, Mrs. William (Margaret Norton)'),
            (887,                               'Montvila, Rev. Juozas'),
            (888,                        'Graham, Miss. Margaret Edith'),
            (889,            'Johnston, Miss. Catherine Helen "Carrie"'),
            (890,                               'Behr, Mr. Karl Howell'),
            (891,                                 'Dooley, Mr. Patrick')],
           names=['PassengerId', 'Name'], length=891)

In [332]:
df2.loc[(1,'Braund, Mr. Owen Harris'), ['Pclass', 'Age']]

KeyError: "['Pclass'] not in index"

In [ ]:
df2.loc[(1,'Braund, Mr. Owen Harris'): (5,'Allen, Mr. William Henry'), ['Pclass', 'Age']]

In [ ]:
df2.iloc[0:5, [1,3]]

# 인덱스를 컬럼으로 되돌리기
* reset_index(drop=True)

In [333]:
df.reset_index(drop=True)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [334]:
df = df.reset_index()
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 컬럼, 인덱스 이름 변경하기
* rename(columns={'원래이름1':"새이름1", '원래이름2':"새이름2"})
* rename(index={'원래이름1':"새이름1", '원래이름2':"새이름2"})

In [335]:
df2=df2.rename(columns={"Pclass":'선실등급', "Sex": '성별'}) # 재할당 해줘야 함
df2

,,Survived,선실등급,성별,Age,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Name,,,,,,,,,
1,"Braund, Mr. Owen Harris",0,3,male,22.0,0,A/5 21171,7.2500,NaN,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,female,38.0,0,PC 17599,71.2833,C85,C
3,"Heikkinen, Miss. Laina",1,3,female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1,female,35.0,0,113803,53.1000,C123,S
5,"Allen, Mr. William Henry",0,3,male,35.0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",0,2,male,27.0,0,211536,13.0000,NaN,S
888,"Graham, Miss. Margaret Edith",1,1,female,19.0,0,112053,30.0000,B42,S
889,"Johnston, Miss. Catherine Helen ""Carrie""",0,3,female,NaN,2,W./C. 6607,23.4500,NaN,S
890,"Behr, Mr. Karl Howell",1,1,male,26.0,0,111369,30.0000,C148,C
891,"Dooley, Mr. Patrick",0,3,male,32.0,0,370376,7.7500,NaN,Q

In [336]:
df2.index

MultiIndex([(  1,                             'Braund, Mr. Owen Harris'),
            (  2, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'),
            (  3,                              'Heikkinen, Miss. Laina'),
            (  4,        'Futrelle, Mrs. Jacques Heath (Lily May Peel)'),
            (  5,                            'Allen, Mr. William Henry'),
            (  6,                                    'Moran, Mr. James'),
            (  7,                             'McCarthy, Mr. Timothy J'),
            (  8,                      'Palsson, Master. Gosta Leonard'),
            (  9,   'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)'),
            ( 10,                 'Nasser, Mrs. Nicholas (Adele Achem)'),
            ...
            (882,                                  'Markun, Mr. Johann'),
            (883,                        'Dahlberg, Miss. Gerda Ulrika'),
            (884,                       'Banfield, Mr. Frederick James'),
            (885,                              'Sutehall, Mr. Henry Jr'),
            (886,                'Rice, Mrs. William (Margaret Norton)'),
            (887,                               'Montvila, Rev. Juozas'),
            (888,                        'Graham, Miss. Margaret Edith'),
            (889,            'Johnston, Miss. Catherine Helen "Carrie"'),
            (890,                               'Behr, Mr. Karl Howell'),
            (891,                                 'Dooley, Mr. Patrick')],
           names=['PassengerId', 'Name'], length=891)

In [337]:
df.rename(index={0:'영', 1:'일'})

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
영,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
일,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

* .columns를 이용한 컬럼명 수정
* 컬럼의 개수와 변경할 컬럼 이름의 개수가 동일해야지만 작동

In [338]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

In [339]:
newcols=['승객번호', '생존여부', '선실등급', '이름', '성별', '나이', '형제자매수', '부모자녀수', '티켓번호', '티켓가격',
        '선실번호', '승선지']

In [340]:
print("df.columns", len(df.columns), "newcols", len(newcols))

df.columns 12 newcols 12

In [341]:
df.columns = newcols
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,티켓가격,선실번호,승선지
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 컬럼 추가하기
* dict의 key,value 추가하는 것과 동일
* 변수명[key] = value
* 데이터프레임변수명['컬럼명']=value

In [342]:
df['가족수'] = 0
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,티켓가격,선실번호,승선지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

# 원하는 위치에 컬럼 추가하기
* 변수명.insert(위치인덱스, '컬럼명', value)

In [343]:
df.insert(3, '성', "Harris")
df

,승객번호,생존여부,선실등급,성,이름,성별,나이,형제자매수,부모자녀수,티켓번호,티켓가격,선실번호,승선지,가족수
0,1,0,3,Harris,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,Harris,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,Harris,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,Harris,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,Harris,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,Harris,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,Harris,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,Harris,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,1,1,Harris,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,Harris,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [344]:
df.columns

Index(['승객번호', '생존여부', '선실등급', '성', '이름', '성별', '나이', '형제자매수', '부모자녀수', '티켓번호',
       '티켓가격', '선실번호', '승선지', '가족수'],
      dtype='str')

In [345]:
df['형제자매수']+df['부모자녀수']

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Length: 891, dtype: int64

In [346]:
df['가족수']=df['형제자매수']+df['부모자녀수']
df

,승객번호,생존여부,선실등급,성,이름,성별,나이,형제자매수,부모자녀수,티켓번호,티켓가격,선실번호,승선지,가족수
0,1,0,3,Harris,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,Harris,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,Harris,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,Harris,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,Harris,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,Harris,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,Harris,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,Harris,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,Harris,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,Harris,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

# 컬럼 삭제하기
* del 변수명['컬럼명']
* df.drop('컬럼명', aixs=1)
* df.drop(['컬럼명1', '컬럼명2'], aixs=1)

In [347]:
del df['성']
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,티켓가격,선실번호,승선지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [348]:
df=df.drop(['형제자매수', '부모자녀수'], axis=1) # 저장하고 싶으면 재할당해줘야 함
# axis=1은 열(column) 기준으로 작업하겠다"는 뜻
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,NaN,Q,0

In [349]:
df2

,,Survived,선실등급,성별,Age,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Name,,,,,,,,,
1,"Braund, Mr. Owen Harris",0,3,male,22.0,0,A/5 21171,7.2500,NaN,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,female,38.0,0,PC 17599,71.2833,C85,C
3,"Heikkinen, Miss. Laina",1,3,female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1,female,35.0,0,113803,53.1000,C123,S
5,"Allen, Mr. William Henry",0,3,male,35.0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",0,2,male,27.0,0,211536,13.0000,NaN,S
888,"Graham, Miss. Margaret Edith",1,1,female,19.0,0,112053,30.0000,B42,S
889,"Johnston, Miss. Catherine Helen ""Carrie""",0,3,female,NaN,2,W./C. 6607,23.4500,NaN,S
890,"Behr, Mr. Karl Howell",1,1,male,26.0,0,111369,30.0000,C148,C
891,"Dooley, Mr. Patrick",0,3,male,32.0,0,370376,7.7500,NaN,Q

In [350]:
df2.pop('SibSp')   # 왜 안되지 ????????

KeyError: 'SibSp'

# 데이터 타입 바꾸기
* .astype(자료형)
* .apply(형변환함수)

In [351]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   승객번호    891 non-null    int64
 1   생존여부    891 non-null    int64
 2   선실등급    891 non-null    int64
 3   이름      891 non-null    str
 4   성별      891 non-null    str
 5   나이      714 non-null    float64
 6   티켓번호    891 non-null    str
 7   티켓가격    891 non-null    float64
 8   선실번호    204 non-null    str
 9   승선지     889 non-null    str
 10  가족수     891 non-null    int64
dtypes: float64(2), int64(4), str(5)
memory usage: 76.7 KB

In [352]:
df['티켓가격'].astype('int')

0       7
1      71
2       7
3      53
4       8
       ..
886    13
887    30
888    23
889    30
890     7
Name: 티켓가격, Length: 891, dtype: int64

In [353]:
df['승객번호'].astype('int8')

0        1
1        2
2        3
3        4
4        5
      ...
886    119
887    120
888    121
889    122
890    123
Name: 승객번호, Length: 891, dtype: int8

In [354]:
df['승객번호'].apply(str) # astype과 차이점

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: 승객번호, Length: 891, dtype: str

# apply 함수
* 컬럼의 자료나 데이터프레임의 행을 하나씩 꺼내서 함수 처리 후 재할당
* series.apply() : 자료를 순차적으로 꺼내서 apply 안쪽의 함수 처리
* DataFrame.apply(함수, axis=1) : 데이터프레임의 행을 1개씩 꺼내서 함수 처리

In [355]:
# df['승객번호']의 요소를 꺼내서 홀수, 짝수로 출력하기
df['승객번호'].apply(lambda x: "짝수" if x%2==0 else "홀수") # 람다 함수: 이름 없이, 한 줄로 간단하게 쓰는 함수

0      홀수
1      짝수
2      홀수
3      짝수
4      홀수
       ..
886    홀수
887    짝수
888    홀수
889    짝수
890    홀수
Name: 승객번호, Length: 891, dtype: str

In [356]:
df['승객번호'].apply(lambda x: np.where(x%2 == 0, "짝수", "홀수"))

0      홀수
1      짝수
2      홀수
3      짝수
4      홀수
       ..
886    홀수
887    짝수
888    홀수
889    짝수
890    홀수
Name: 승객번호, Length: 891, dtype: str

In [357]:
df['이름'].apply(lambda x: x.split(","))

0                             [Braund,  Mr. Owen Harris]
1      [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                              [Heikkinen,  Miss. Laina]
3        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                            [Allen,  Mr. William Henry]
                             ...
886                             [Montvila,  Rev. Juozas]
887                      [Graham,  Miss. Margaret Edith]
888          [Johnston,  Miss. Catherine Helen "Carrie"]
889                             [Behr,  Mr. Karl Howell]
890                               [Dooley,  Mr. Patrick]
Name: 이름, Length: 891, dtype: object

In [358]:
df[['명', '성']]=df['이름'].apply(lambda x: pd.Series(x.split(","))) 
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick

In [359]:
df.apply(lambda x: x[['이름', '성별']], axis=1)

                                                    이름      성별
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

# Pandas DataFrame에서 조건에 맞는 행만 가져오기 ** 중요 **
```python
df[df['컬럼명'] 조건식]
```
* 조건식의 연산자 >, <, >=, <=, ==, !=, &, |

In [360]:
# 승객번호가 3번인 행을 출력하세요
df[df['승객번호']==3]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.925,NaN,S,0,Heikkinen,Miss. Laina

In [361]:
# 나이가 35 초과인 사람만 필터링
df[df['나이'] > 35]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,17463,51.8625,E46,S,0,McCarthy,Mr. Timothy J
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,113783,26.5500,C103,S,0,Bonnell,Miss. Elizabeth
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,347082,31.2750,NaN,S,6,Andersson,Mr. Anders Johan
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,248706,16.0000,NaN,S,0,Hewlett,Mrs. (Mary D Kingcome)
...,...,...,...,...,...,...,...,...,...,...,...,...,...
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,236852,13.0000,NaN,S,0,Bystrom,Mrs. (Karolina)
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,11751,52.5542,D35,S,2,Beckwith,Mrs. Richard Leonard (Sallie Monypeny)
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,345765,9.0000,NaN,S,0,Vander Cruyssen,Mr. Victor
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,11767,83.1583,C50,C,1,Potter,Mrs. Thomas Jr (Lily Alexenia Wilson)
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,382652,29.1250,NaN,Q,5,Rice,Mrs. William (Margaret Norton)

* 조건이 2개 이상인 경우 and 조건 &
```python
df[(df[컬럼명1]==조건1) & (df[컬럼명2]==조건2)]
```

In [362]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick

In [363]:
# 성별이 여성이면서 나이가 35세 초과인 행 찾기 & 조건
df[(df['성별']=="female") & (df['나이'] > 35)]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,113783,26.5500,C103,S,0,Bonnell,Miss. Elizabeth
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,248706,16.0000,NaN,S,0,Hewlett,Mrs. (Mary D Kingcome)
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,347077,31.3875,NaN,S,6,Asplund,Mrs. Carl Oscar (Selma Augusta Emilia Johansson)
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,7546,9.4750,NaN,S,1,Ahlin,Mrs. Johan (Johanna Persdotter Larsson)
...,...,...,...,...,...,...,...,...,...,...,...,...,...
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,17466,25.9292,D17,S,0,Swift,Mrs. Frederick Joel (Margaret Welles Barron)
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,236852,13.0000,NaN,S,0,Bystrom,Mrs. (Karolina)
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,11751,52.5542,D35,S,2,Beckwith,Mrs. Richard Leonard (Sallie Monypeny)
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,11767,83.1583,C50,C,1,Potter,Mrs. Thomas Jr (Lily Alexenia Wilson)
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,382652,29.1250,NaN,Q,5,Rice,Mrs. William (Margaret Norton)

In [364]:
# 성별이 남성, 선실등급 1등급, 생존여부가 1인 조건
df[(df['성별']=="male") & (df['선실등급'] == 1) & (df['생존여부'] == 1)]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성
23,24,1,1,"Sloper, Mr. William Thompson",male,28.00,113788,35.5000,A6,S,0,Sloper,Mr. William Thompson
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,19947,35.5000,C52,S,0,Woolner,Mr. Hugh
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.00,PC 17759,63.3583,D10 D12,C,1,Greenfield,Mr. William Bertram
187,188,1,1,"Romaine, Mr. Charles Hallace (""Mr C Rolmane"")",male,45.00,111428,26.5500,NaN,S,0,Romaine,"Mr. Charles Hallace (""Mr C Rolmane"")"
209,210,1,1,"Blank, Mr. Henry",male,40.00,112277,31.0000,A31,C,0,Blank,Mr. Henry
224,225,1,1,"Hoyt, Mr. Frederick Maxfield",male,38.00,19943,90.0000,C93,S,1,Hoyt,Mr. Frederick Maxfield
248,249,1,1,"Beckwith, Mr. Richard Leonard",male,37.00,11751,52.5542,D35,S,2,Beckwith,Mr. Richard Leonard
298,299,1,1,"Saalfeld, Mr. Adolphe",male,NaN,19988,30.5000,C106,S,0,Saalfeld,Mr. Adolphe
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,113781,151.5500,C22 C26,S,3,Allison,Master. Hudson Trevor
370,371,1,1,"Harder, Mr. George Achilles",male,25.00,11765,55.4417,E50,C,1,Harder,Mr. George Achilles
390,391,1,1,"Carter, Mr. William Ernest",male,36.00,113760,120.0000,B96 B98,S,3,Carter,Mr. William Ernest
430,431,1,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.00,110564,26.5500,C52,S,0,Bjornstrom-Steffansson,Mr. Mauritz Hakan
445,446,1,1,"Dodge, Master. Washington",male,4.00,33638,81.8583,A34,S,2,Dodge,Master. Washington
447,448,1,1,"Seward, Mr. Frederic Kimber",male,34.00,113794,26.5500,NaN,S,0,Seward,Mr. Frederic Kimber
449,450,1,1,"Peuchen, Major. Arthur Godfrey",male,52.00,113786,30.5000,C104,S,0,Peuchen,Major. Arthur Godfrey
453,454,1,1,"Goldenberg, Mr. Samuel L",male,49.00,17453,89.1042,C92,C,1,Goldenberg,Mr. Samuel L
460,461,1,1,"Anderson, Mr. Harry",male,48.00,19952,26.5500,E12,S,0,Anderson,Mr. Harry
484,485,1,1,"Bishop, Mr. Dickinson H",male,25.00,11967,91.0792,B49,C,1,Bishop,Mr. Dickinson H
507,508,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,111427,26.5500,NaN,S,0,Bradley,"Mr. George (""George Arthur Brayton"")"
512,513,1,1,"McGough, Mr. James Robert",male,36.00,PC 17473,26.2875,E25,S,0,McGough,Mr. James Robert
550,551,1,1,"Thayer, Mr. John Borland Jr",male,17.00,17421,110.8833,C70,C,2,Thayer,Mr. John Borland Jr
572,573,1,1,"Flynn, Mr. John Irwin (""Irving"")",male,36.00,PC 17474,26.3875,E25,S,0,Flynn,"Mr. John Irwin (""Irving"")"
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.00,13567,79.2000,B41,C,2,Frolicher-Stehli,Mr. Maxmillian
599,600,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.00,PC 17485,56.9292,A20,C,1,Duff Gordon,"Sir. Cosmo Edmund (""Mr Morgan"")"
604,605,1,1,"Homer, Mr. Harry (""Mr E Haven"")",male,35.00,111426,26.5500,NaN,C,0,Homer,"Mr. Harry (""Mr E Haven"")"
607,608,1,1,"Daniel, Mr. Robert Williams",male,27.00,113804,30.5000,NaN,S,0,Daniel,Mr. Robert Williams
621,622,1,1,"Kimball, Mr. Edwin Nelson Jr",male,42.00,11753,52.5542,D19,S,1,Kimball,Mr. Edwin Nelson Jr
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,27042,30.0000,A23,S,0,Barkworth,Mr. Algernon Henry Wilson
632,633,1,1,"Stahelin-Maeglin, Dr. Max",male,32.00,13214,30.5000,B50,C,0,Stahelin-Maeglin,Dr. Max
645,646,1,1,"Harper, Mr. Henry Sleeper",male,48.00,PC 17572,76.7292,D33,C,1,Harper,Mr. Henry Sleeper
647,648,1,1,"Simonius-Blumer, Col. Oberst Alfons",male,56.00,13213,35.5000,A26,C,0,Simonius-Blumer,Col. Oberst Alfons
660,661,1,1,"Frauenthal, Dr. Henry William",male,50.00,PC 17611,133.6500,NaN,S,2,Frauenthal,Dr. Henry William
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.00,PC 17755,512.3292,B51 B53 B55,C,1,Cardeza,Mr. Thomas Drake Martinez
681,682,1,1,"Hassab, Mr. Hammad",male,27.00,PC 17572,76.7292,D49,C,0,Hassab,Mr. Hammad
690,691,1,1,"Dick, Mr. Albert Adrian",male,31.00,17474,57.0000,B20,S,1,Dick,Mr. Albert Adrian
701,702,1,1,"Silverthorne, Mr. Spencer Victor",male,35.00,PC 17475,26.2875,E24,S,0,Silverthorne,Mr. Spencer Victor
707,708,1,1,"Calderhead, Mr. Edward Pennington",male,42.00,PC 17476,26.2875,E24,S,0,Calderhead,Mr. Edward Pennington
712,713,1,1,"Taylor, Mr. Elmer Zebley",male,48.00,19996,52.0000,C126,S,1,Taylor,Mr. Elmer Zebley
724,725,1,1,"Chambers, Mr. Norman Campbell",male,27.00,113806,53.1000,E8,S,1,Chambers,Mr. Norman Campbell
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.00,PC 17755,512.3292,B101,C,0,Lesurer,Mr. Gustave J
740,741,1,1,"Hawksford, Mr. Walter James",male,NaN,16988,30.0000,D45,S,0,Hawksford,Mr. Walter James
802,803,1,1,"Carter, Master. William Thornton II",male,11.00,113760,120.0000,B96 B98,S,3,Carter,Master. William Thornton II
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,11774,29.7000,C47,C,0,Marechal,Mr. Pierre
857,858,1,1,"Daly, Mr. Peter Denis",male,51.00,113055,26.5500,E17,S,0,Daly,Mr. Peter Denis
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell

In [365]:
# 성별이 남성, 선실등급 1 혹은 2이고 생존여부가 1인 사람들을 찾으세요
df[(df['성별']=="male") & ((df['선실등급'] == 1) | (df['선실등급'] == 2)) & (df['생존여부'] == 1)] # or일때 괄호 두번 묶어주기 !!

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,244373,13.0000,NaN,S,0,Williams,Mr. Charles Eugene
21,22,1,2,"Beesley, Mr. Lawrence",male,34.00,248698,13.0000,D56,S,0,Beesley,Mr. Lawrence
23,24,1,1,"Sloper, Mr. William Thompson",male,28.00,113788,35.5000,A6,S,0,Sloper,Mr. William Thompson
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,19947,35.5000,C52,S,0,Woolner,Mr. Hugh
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,248738,29.0000,NaN,S,2,Caldwell,Master. Alden Gates
...,...,...,...,...,...,...,...,...,...,...,...,...,...
827,828,1,2,"Mallet, Master. Andre",male,1.00,S.C./PARIS 2079,37.0042,NaN,C,2,Mallet,Master. Andre
831,832,1,2,"Richards, Master. George Sibley",male,0.83,29106,18.7500,NaN,S,2,Richards,Master. George Sibley
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,11774,29.7000,C47,C,0,Marechal,Mr. Pierre
857,858,1,1,"Daly, Mr. Peter Denis",male,51.00,113055,26.5500,E17,S,0,Daly,Mr. Peter Denis
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell

In [366]:
df[(df['성별']=="male") & (df['선실등급'].isin([1,2])) & (df['생존여부'] == 1)]  # isin 사용 가능

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,244373,13.0000,NaN,S,0,Williams,Mr. Charles Eugene
21,22,1,2,"Beesley, Mr. Lawrence",male,34.00,248698,13.0000,D56,S,0,Beesley,Mr. Lawrence
23,24,1,1,"Sloper, Mr. William Thompson",male,28.00,113788,35.5000,A6,S,0,Sloper,Mr. William Thompson
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,19947,35.5000,C52,S,0,Woolner,Mr. Hugh
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,248738,29.0000,NaN,S,2,Caldwell,Master. Alden Gates
...,...,...,...,...,...,...,...,...,...,...,...,...,...
827,828,1,2,"Mallet, Master. Andre",male,1.00,S.C./PARIS 2079,37.0042,NaN,C,2,Mallet,Master. Andre
831,832,1,2,"Richards, Master. George Sibley",male,0.83,29106,18.7500,NaN,S,2,Richards,Master. George Sibley
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,11774,29.7000,C47,C,0,Marechal,Mr. Pierre
857,858,1,1,"Daly, Mr. Peter Denis",male,51.00,113055,26.5500,E17,S,0,Daly,Mr. Peter Denis
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell

* 선실 등급별 승차권 금액의 최소, 최대, 평균 등 4분위수를 보고싶을 때 (1등실만 필터링)

In [367]:
df[df['선실등급']==1]['티켓가격'].describe()

count    216.000000
mean      84.154687
std       78.380373
min        0.000000
25%       30.923950
50%       60.287500
75%       93.500000
max      512.329200
Name: 티켓가격, dtype: float64

# 조건에 맞는 행을 찾은 후 특정 컬럼만 조회하기

In [368]:
# 선실등급이 1이거나 2면서 생존한 여성들 중에서 나이만 보고 싶을 때
df[(df['선실등급'].isin([1,2])) & (df['생존여부']==1) & (df['성별']=='female')]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,237736,30.0708,NaN,C,1,Nasser,Mrs. Nicholas (Adele Achem)
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,113783,26.5500,C103,S,0,Bonnell,Miss. Elizabeth
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,248706,16.0000,NaN,S,0,Hewlett,Mrs. (Mary D Kingcome)
...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,11751,52.5542,D35,S,2,Beckwith,Mrs. Richard Leonard (Sallie Monypeny)
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,P/PP 3381,24.0000,NaN,C,1,Abelson,Mrs. Samuel (Hannah Wizosky)
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,11767,83.1583,C50,C,1,Potter,Mrs. Thomas Jr (Lily Alexenia Wilson)
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,230433,26.0000,NaN,S,1,Shelley,Mrs. William (Imanita Parrish Hall)
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith

In [369]:
# 그 중 '나이' 컬럼만 보고 싶을 때
df.loc[(df['선실등급'].isin([1,2])) & (df['생존여부']==1) & (df['성별']=='female'), '나이']

1      38.0
3      35.0
9      14.0
11     58.0
15     55.0
       ...
871    47.0
874    28.0
879    56.0
880    25.0
887    19.0
Name: 나이, Length: 161, dtype: float64

In [370]:
# 나이'와 '이름' 컬럼만 보고 싶을 때
df.loc[(df['선실등급'].isin([1,2])) & (df['생존여부']==1) & (df['성별']=='female'), ['나이', '이름']]

       나이                                                 이름
1    38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
3    35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
9    14.0                Nasser, Mrs. Nicholas (Adele Achem)
11   58.0                           Bonnell, Miss. Elizabeth
15   55.0                   Hewlett, Mrs. (Mary D Kingcome)
..    ...                                                ...
871  47.0   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
874  28.0              Abelson, Mrs. Samuel (Hannah Wizosky)
879  56.0      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880  25.0       Shelley, Mrs. William (Imanita Parrish Hall)
887  19.0                       Graham, Miss. Margaret Edith

[161 rows x 2 columns]

# Series와 함께 사용하는 문자열 함수
* .str.contains()
* .str.split()
* .str.replace()
* .str.lower()
* .str.upper()
* .str.join()
* .str.strip()

* 특정 단어를 포함한 행 찾기
* .str.contains("찾을 단어")
* SQL: where 이름 like "%Joseph%"

In [371]:
df[df['이름'].str.contains("Joseph")]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,239865,26.0000,NaN,S,0,Fynney,Mr. Joseph J
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,PC 17604,82.1708,NaN,C,1,Meyer,Mr. Edgar Joseph
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,374910,8.0500,NaN,S,0,Shorney,Mr. Charles Joseph
140,141,0,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,2678,15.2458,NaN,C,2,Boulos,Mrs. Joseph (Sultana)
145,146,0,2,"Nicholls, Mr. Joseph Charles",male,19.0,C.A. 33112,36.7500,NaN,S,2,Nicholls,Mr. Joseph Charles
194,195,1,1,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,PC 17610,27.7208,B4,C,0,Brown,Mrs. James Joseph (Margaret Tobin)
375,376,1,1,"Meyer, Mrs. Edgar Joseph (Leila Saks)",female,NaN,PC 17604,82.1708,NaN,C,1,Meyer,Mrs. Edgar Joseph (Leila Saks)
454,455,0,3,"Peduzzi, Mr. Joseph",male,NaN,A/5 2817,8.0500,NaN,S,0,Peduzzi,Mr. Joseph
532,533,0,3,"Elias, Mr. Joseph Jr",male,17.0,2690,7.2292,NaN,C,2,Elias,Mr. Joseph Jr
559,560,1,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.0,345572,17.4000,NaN,S,1,de Messemaeker,Mrs. Guillaume Joseph (Emma)
578,579,0,3,"Caram, Mrs. Joseph (Maria Elias)",female,NaN,2689,14.4583,NaN,C,1,Caram,Mrs. Joseph (Maria Elias)
589,590,0,3,"Murdlin, Mr. Joseph",male,NaN,A./5. 3235,8.0500,NaN,S,0,Murdlin,Mr. Joseph
608,609,1,2,"Laroche, Mrs. Joseph (Juliette Marie Louise La...",female,22.0,SC/Paris 2123,41.5792,NaN,C,3,Laroche,Mrs. Joseph (Juliette Marie Louise Lafargue)
685,686,0,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,SC/Paris 2123,41.5792,NaN,C,3,Laroche,Mr. Joseph Philippe Lemercier
752,753,0,3,"Vande Velde, Mr. Johannes Joseph",male,33.0,345780,9.5000,NaN,S,0,Vande Velde,Mr. Johannes Joseph
828,829,1,3,"McCormack, Mr. Thomas Joseph",male,NaN,367228,7.7500,NaN,Q,0,McCormack,Mr. Thomas Joseph

In [372]:
df['이름'].split(",")

AttributeError: 'Series' object has no attribute 'split'

In [373]:
print(type(df['이름']), type(df['이름'][0]))

<class 'pandas.Series'> <class 'str'>

In [374]:
df['이름'].str.split(",")

0                             [Braund,  Mr. Owen Harris]
1      [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                              [Heikkinen,  Miss. Laina]
3        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                            [Allen,  Mr. William Henry]
                             ...
886                             [Montvila,  Rev. Juozas]
887                      [Graham,  Miss. Margaret Edith]
888          [Johnston,  Miss. Catherine Helen "Carrie"]
889                             [Behr,  Mr. Karl Howell]
890                               [Dooley,  Mr. Patrick]
Name: 이름, Length: 891, dtype: object

In [375]:
df['이름'].str.split(",", expand=True)

             0                                            1
0       Braund                              Mr. Owen Harris
1      Cumings   Mrs. John Bradley (Florence Briggs Thayer)
2    Heikkinen                                  Miss. Laina
3     Futrelle           Mrs. Jacques Heath (Lily May Peel)
4        Allen                            Mr. William Henry
..         ...                                          ...
886   Montvila                                  Rev. Juozas
887     Graham                         Miss. Margaret Edith
888   Johnston               Miss. Catherine Helen "Carrie"
889       Behr                              Mr. Karl Howell
890     Dooley                                  Mr. Patrick

[891 rows x 2 columns]

In [376]:
df[["First_name", "Last_name"]]=df['이름'].str.split(",", expand=True)
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성,First_name,Last_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie""",Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell,Behr,Mr. Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick,Dooley,Mr. Patrick

In [377]:
# .str.replace("없앨문자", "새문자")
df['이름'].str.replace("(", "").str.replace(")", "")

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley Florence Briggs Thayer
2                                 Heikkinen, Miss. Laina
3             Futrelle, Mrs. Jacques Heath Lily May Peel
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: 이름, Length: 891, dtype: str

In [378]:
# lower
df['이름'].str.lower()

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: 이름, Length: 891, dtype: str

In [379]:
# upper
df['이름'].str.upper()

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: 이름, Length: 891, dtype: str

In [380]:
df['name_list']=df['이름'].str.split()
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성,First_name,Last_name,name_list
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris,Braund,Mr. Owen Harris,"[Braund,, Mr., Owen, Harris]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),Cumings,Mrs. John Bradley (Florence Briggs Thayer),"[Cumings,, Mrs., John, Bradley, (Florence, Bri..."
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina,Heikkinen,Miss. Laina,"[Heikkinen,, Miss., Laina]"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),Futrelle,Mrs. Jacques Heath (Lily May Peel),"[Futrelle,, Mrs., Jacques, Heath, (Lily, May, ..."
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry,Allen,Mr. William Henry,"[Allen,, Mr., William, Henry]"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas,Montvila,Rev. Juozas,"[Montvila,, Rev., Juozas]"
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith,Graham,Miss. Margaret Edith,"[Graham,, Miss., Margaret, Edith]"
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie""",Johnston,"Miss. Catherine Helen ""Carrie""","[Johnston,, Miss., Catherine, Helen, ""Carrie""]"
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell,Behr,Mr. Karl Howell,"[Behr,, Mr., Karl, Howell]"
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,NaN,Q,0,Dooley,Mr. Patrick,Dooley,Mr. Patrick,"[Dooley,, Mr., Patrick]"

In [381]:
# .str.join("구분자")
# python 문자열 함수 "".join(list)
df['namee_list'].str.join()       # 다시 채우기

KeyError: 'namee_list'

In [ ]:
df['이름'].str.strip()

# groupby
* 특정 기준 컬럼을 지정해서 다른 컬럼의 통계량 (평균, 최소, 최대, 개수)
```python
df.groupby('기준컬럼')['보고싶은 컬럼'].집합함수(sum(), mean(), max())
df[['보고싶은 컬럼1', '보고싶은 컬럼2']].groupby('기준컬럼').집합함수
```

* 성별별 생존여부

In [382]:
df.groupby('성별')['생존여부'].value_counts()

성별      생존여부
female  1       233
        0        81
male    0       468
        1       109
Name: count, dtype: int64

In [383]:
surv=df[['성별', '생존여부']].groupby('성별').value_counts()  # 위 코드보다 좀 더 빠르게 데이터 가져옴

In [384]:
surv_df=pd.DataFrame(surv)
surv_df

             count
성별     생존여부
female 1       233
       0        81
male   0       468
       1       109

In [385]:
surv_df.index

MultiIndex([('female', 1),
            ('female', 0),
            (  'male', 0),
            (  'male', 1)],
           names=['성별', '생존여부'])

In [386]:
# 성별별 생존율 구하기
print("여성 생존율: ", 233/(233+81)*100)
print("남성 생존율: ", 109/(109+468)*100)

여성 생존율:  74.20382165605095
남성 생존율:  18.890814558058924

In [387]:
surv_df.index

MultiIndex([('female', 1),
            ('female', 0),
            (  'male', 0),
            (  'male', 1)],
           names=['성별', '생존여부'])

In [388]:
female_surv=surv_df.loc[('female', 1), 'count']/(surv_df.loc[('female', 1), 'count'] + surv_df.loc[('female', 0), 'count'])*100
male_surv=surv_df.loc[('male', 1), 'count']/(surv_df.loc[('male', 1), 'count'] + surv_df.loc[('male', 0), 'count'])*100
print("여성 생존율: ", female_surv)
print("남성 생존율: ", male_surv)

여성 생존율:  74.20382165605095
남성 생존율:  18.890814558058924

In [389]:
ticket_desc=df['티켓가격'].describe()
ticket_desc

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: 티켓가격, dtype: float64

In [390]:
ticket_desc.index

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='str')

In [391]:
ticket_desc['25%']

np.float64(7.9104)

* groupby 조건을 2개 이상 줄 때

In [392]:
df.columns

Index(['승객번호', '생존여부', '선실등급', '이름', '성별', '나이', '티켓번호', '티켓가격', '선실번호', '승선지',
       '가족수', '명', '성', 'First_name', 'Last_name', 'name_list'],
      dtype='str')

In [393]:
# 성별별, 선실등급별 생존자 수
df[['성별', '선실등급', '생존여부']].groupby(['성별', '선실등급']).value_counts()

성별      선실등급  생존여부
female  1     1        91
              0         3
        2     1        70
              0         6
        3     1        72
              0        72
male    1     0        77
              1        45
        2     0        91
              1        17
        3     0       300
              1        47
Name: count, dtype: int64

In [394]:
# 성별별, 선실등급별 생존률
df[['성별', '선실등급', '생존여부']].groupby(['성별', '선실등급']).mean() * 100

                  생존여부
성별     선실등급
female 1     96.808511
       2     92.105263
       3     50.000000
male   1     36.885246
       2     15.740741
       3     13.544669

* 그룹 연산 후 여러 개 함수 결과값 보기

In [395]:
# 성별별 나이의 개수, 평균 나이, 최소값, 최대값
df[['성별', '나이']].groupby('성별').describe()

           나이
        count       mean        std   min   25%   50%   75%   max
성별
female  261.0  27.915709  14.110146  0.75  18.0  27.0  37.0  63.0
male    453.0  30.726645  14.678201  0.42  21.0  29.0  39.0  80.0

* .agg([min, max, mean])

In [396]:
# 성별별 나이의 개수, 평균 나이, 최소값, 최대값
df[['성별', '나이']].groupby('성별').agg(['mean', 'min', 'max'])

               나이
             mean   min   max
성별
female  27.915709  0.75  63.0
male    30.726645  0.42  80.0

# 피벗테이블 pivot

In [397]:
df.pivot_table(values="생존여부", index="성별", columns='선실등급')

선실등급           1         2         3
성별
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# 결측값 찾기 (값이 없는 것)

In [398]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   승객번호        891 non-null    int64
 1   생존여부        891 non-null    int64
 2   선실등급        891 non-null    int64
 3   이름          891 non-null    str
 4   성별          891 non-null    str
 5   나이          714 non-null    float64
 6   티켓번호        891 non-null    str
 7   티켓가격        891 non-null    float64
 8   선실번호        204 non-null    str
 9   승선지         889 non-null    str
 10  가족수         891 non-null    int64
 11  명           891 non-null    str
 12  성           891 non-null    str
 13  First_name  891 non-null    str
 14  Last_name   891 non-null    str
 15  name_list   891 non-null    object
dtypes: float64(2), int64(4), object(1), str(9)
memory usage: 111.5+ KB

* isna() 결측값인지 아닌지 확인 => True(1), False(0) => sum() 결측값의 개수/ 결측이면 True

In [399]:
df.isna()

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성,First_name,Last_name,name_list
0,False,False,False,False,False,False,False,False,True,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,True,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,True,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,True,False,False,False,False,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,True,False,False,False,False,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,True,False,False,False,False,False,False,False

In [400]:
df.isna().sum()  # 승선지에는 2개의 결측이 있구나

승객번호            0
생존여부            0
선실등급            0
이름              0
성별              0
나이            177
티켓번호            0
티켓가격            0
선실번호          687
승선지             2
가족수             0
명               0
성               0
First_name      0
Last_name       0
name_list       0
dtype: int64

In [401]:
df.isna().sum() / len(df) * 100

승객번호           0.000000
생존여부           0.000000
선실등급           0.000000
이름             0.000000
성별             0.000000
나이            19.865320
티켓번호           0.000000
티켓가격           0.000000
선실번호          77.104377
승선지            0.224467
가족수            0.000000
명              0.000000
성              0.000000
First_name     0.000000
Last_name      0.000000
name_list      0.000000
dtype: float64

* dropna() 결측값이 있는 행을 삭제

In [402]:
df.dropna()

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성,First_name,Last_name,name_list
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),Cumings,Mrs. John Bradley (Florence Briggs Thayer),"[Cumings,, Mrs., John, Bradley, (Florence, Bri..."
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),Futrelle,Mrs. Jacques Heath (Lily May Peel),"[Futrelle,, Mrs., Jacques, Heath, (Lily, May, ..."
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,17463,51.8625,E46,S,0,McCarthy,Mr. Timothy J,McCarthy,Mr. Timothy J,"[McCarthy,, Mr., Timothy, J]"
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,PP 9549,16.7000,G6,S,2,Sandstrom,Miss. Marguerite Rut,Sandstrom,Miss. Marguerite Rut,"[Sandstrom,, Miss., Marguerite, Rut]"
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,113783,26.5500,C103,S,0,Bonnell,Miss. Elizabeth,Bonnell,Miss. Elizabeth,"[Bonnell,, Miss., Elizabeth]"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,11751,52.5542,D35,S,2,Beckwith,Mrs. Richard Leonard (Sallie Monypeny),Beckwith,Mrs. Richard Leonard (Sallie Monypeny),"[Beckwith,, Mrs., Richard, Leonard, (Sallie, M..."
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,695,5.0000,B51 B53 B55,S,0,Carlsson,Mr. Frans Olof,Carlsson,Mr. Frans Olof,"[Carlsson,, Mr., Frans, Olof]"
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,11767,83.1583,C50,C,1,Potter,Mrs. Thomas Jr (Lily Alexenia Wilson),Potter,Mrs. Thomas Jr (Lily Alexenia Wilson),"[Potter,, Mrs., Thomas, Jr, (Lily, Alexenia, W..."
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith,Graham,Miss. Margaret Edith,"[Graham,, Miss., Margaret, Edith]"
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell,Behr,Mr. Karl Howell,"[Behr,, Mr., Karl, Howell]"

In [403]:
df.drop('선실번호', axis=1)  # 코드 다시 보기

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,승선지,가족수,명,성,First_name,Last_name,name_list
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,S,1,Braund,Mr. Owen Harris,Braund,Mr. Owen Harris,"[Braund,, Mr., Owen, Harris]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),Cumings,Mrs. John Bradley (Florence Briggs Thayer),"[Cumings,, Mrs., John, Bradley, (Florence, Bri..."
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,S,0,Heikkinen,Miss. Laina,Heikkinen,Miss. Laina,"[Heikkinen,, Miss., Laina]"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),Futrelle,Mrs. Jacques Heath (Lily May Peel),"[Futrelle,, Mrs., Jacques, Heath, (Lily, May, ..."
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,S,0,Allen,Mr. William Henry,Allen,Mr. William Henry,"[Allen,, Mr., William, Henry]"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,S,0,Montvila,Rev. Juozas,Montvila,Rev. Juozas,"[Montvila,, Rev., Juozas]"
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,S,0,Graham,Miss. Margaret Edith,Graham,Miss. Margaret Edith,"[Graham,, Miss., Margaret, Edith]"
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,S,3,Johnston,"Miss. Catherine Helen ""Carrie""",Johnston,"Miss. Catherine Helen ""Carrie""","[Johnston,, Miss., Catherine, Helen, ""Carrie""]"
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C,0,Behr,Mr. Karl Howell,Behr,Mr. Karl Howell,"[Behr,, Mr., Karl, Howell]"
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,Q,0,Dooley,Mr. Patrick,Dooley,Mr. Patrick,"[Dooley,, Mr., Patrick]"

* fillna() 결측값을 다른 값을 채워주는 함수

In [404]:
round(df['나이'].mean())

30

In [405]:
df=df.fillna(round(df['나이'].mean()))
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,티켓가격,선실번호,승선지,가족수,명,성,First_name,Last_name,name_list
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,30,S,1,Braund,Mr. Owen Harris,Braund,Mr. Owen Harris,"[Braund,, Mr., Owen, Harris]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),Cumings,Mrs. John Bradley (Florence Briggs Thayer),"[Cumings,, Mrs., John, Bradley, (Florence, Bri..."
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,30,S,0,Heikkinen,Miss. Laina,Heikkinen,Miss. Laina,"[Heikkinen,, Miss., Laina]"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),Futrelle,Mrs. Jacques Heath (Lily May Peel),"[Futrelle,, Mrs., Jacques, Heath, (Lily, May, ..."
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,30,S,0,Allen,Mr. William Henry,Allen,Mr. William Henry,"[Allen,, Mr., William, Henry]"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,30,S,0,Montvila,Rev. Juozas,Montvila,Rev. Juozas,"[Montvila,, Rev., Juozas]"
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith,Graham,Miss. Margaret Edith,"[Graham,, Miss., Margaret, Edith]"
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,30.0,W./C. 6607,23.4500,30,S,3,Johnston,"Miss. Catherine Helen ""Carrie""",Johnston,"Miss. Catherine Helen ""Carrie""","[Johnston,, Miss., Catherine, Helen, ""Carrie""]"
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell,Behr,Mr. Karl Howell,"[Behr,, Mr., Karl, Howell]"
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,30,Q,0,Dooley,Mr. Patrick,Dooley,Mr. Patrick,"[Dooley,, Mr., Patrick]"

In [406]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   승객번호        891 non-null    int64
 1   생존여부        891 non-null    int64
 2   선실등급        891 non-null    int64
 3   이름          891 non-null    str
 4   성별          891 non-null    str
 5   나이          891 non-null    float64
 6   티켓번호        891 non-null    str
 7   티켓가격        891 non-null    float64
 8   선실번호        891 non-null    object
 9   승선지         891 non-null    object
 10  가족수         891 non-null    int64
 11  명           891 non-null    str
 12  성           891 non-null    str
 13  First_name  891 non-null    str
 14  Last_name   891 non-null    str
 15  name_list   891 non-null    object
dtypes: float64(2), int64(4), object(3), str(7)
memory usage: 111.5+ KB

# 데이터프레임에서 결측값이 있는 행만 필터링

In [407]:
df2.info()

<class 'pandas.DataFrame'>
MultiIndex: 891 entries, (np.int64(1), 'Braund, Mr. Owen Harris') to (np.int64(891), 'Dooley, Mr. Patrick')
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   선실등급      891 non-null    int64
 2   성별        891 non-null    str
 3   Age       714 non-null    float64
 4   Parch     891 non-null    int64
 5   Ticket    891 non-null    str
 6   Fare      891 non-null    float64
 7   Cabin     204 non-null    str
 8   Embarked  889 non-null    str
dtypes: float64(2), int64(3), str(4)
memory usage: 169.0+ KB

In [408]:
df2[df2['Embarked'].isna()]

,,Survived,선실등급,성별,Age,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Name,,,,,,,,,
62,"Icard, Miss. Amelie",1,1,female,38.0,0,113572,80.0,B28,NaN
830,"Stone, Mrs. George Nelson (Martha Evelyn)",1,1,female,62.0,0,113572,80.0,B28,NaN

In [409]:
nan_index=df2[df2['Age'].isna()].index

In [410]:
df2.loc[nan_index, :]

,,Survived,선실등급,성별,Age,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Name,,,,,,,,,
6,"Moran, Mr. James",0,3,male,NaN,0,330877,8.4583,NaN,Q
18,"Williams, Mr. Charles Eugene",1,2,male,NaN,0,244373,13.0000,NaN,S
20,"Masselmani, Mrs. Fatima",1,3,female,NaN,0,2649,7.2250,NaN,C
27,"Emir, Mr. Farred Chehab",0,3,male,NaN,0,2631,7.2250,NaN,C
29,"O'Dwyer, Miss. Ellen ""Nellie""",1,3,female,NaN,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...
860,"Razi, Mr. Raihed",0,3,male,NaN,0,2629,7.2292,NaN,C
864,"Sage, Miss. Dorothy Edith ""Dolly""",0,3,female,NaN,2,CA. 2343,69.5500,NaN,S
869,"van Melkebeke, Mr. Philemon",0,3,male,NaN,0,345777,9.5000,NaN,S
879,"Laleff, Mr. Kristo",0,3,male,NaN,0,349217,7.8958,NaN,S
889,"Johnston, Miss. Catherine Helen ""Carrie""",0,3,female,NaN,2,W./C. 6607,23.4500,NaN,S

In [412]:
df2['Age']=df2['Age'].fillna(round(df2['Age'].mean(), 1))

PassengerId  Name
1            Braund, Mr. Owen Harris                                22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
3            Heikkinen, Miss. Laina                                 26.0
4            Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
5            Allen, Mr. William Henry                               35.0
                                                                    ...
887          Montvila, Rev. Juozas                                  27.0
888          Graham, Miss. Margaret Edith                           19.0
889          Johnston, Miss. Catherine Helen "Carrie"               29.7
890          Behr, Mr. Karl Howell                                  26.0
891          Dooley, Mr. Patrick                                    32.0
Name: Age, Length: 891, dtype: float64

In [413]:
df2.loc[nan_index, :]

,,Survived,선실등급,성별,Age,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Name,,,,,,,,,
6,"Moran, Mr. James",0,3,male,NaN,0,330877,8.4583,NaN,Q
18,"Williams, Mr. Charles Eugene",1,2,male,NaN,0,244373,13.0000,NaN,S
20,"Masselmani, Mrs. Fatima",1,3,female,NaN,0,2649,7.2250,NaN,C
27,"Emir, Mr. Farred Chehab",0,3,male,NaN,0,2631,7.2250,NaN,C
29,"O'Dwyer, Miss. Ellen ""Nellie""",1,3,female,NaN,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...
860,"Razi, Mr. Raihed",0,3,male,NaN,0,2629,7.2292,NaN,C
864,"Sage, Miss. Dorothy Edith ""Dolly""",0,3,female,NaN,2,CA. 2343,69.5500,NaN,S
869,"van Melkebeke, Mr. Philemon",0,3,male,NaN,0,345777,9.5000,NaN,S
879,"Laleff, Mr. Kristo",0,3,male,NaN,0,349217,7.8958,NaN,S
889,"Johnston, Miss. Catherine Helen ""Carrie""",0,3,female,NaN,2,W./C. 6607,23.4500,NaN,S

# 여러개의 데이터프레임 합치기
* concat: 두 개의 데이터프레임을 1개로 합침
* merge: sql의 join과 같은 역할, 공통된 기준 컬럼을 매칭해서 합침
* join: sql의 join과 같은 역할, index가 같은 것끼리 합침

In [416]:
import os
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from dotenv import load_dotenv
load_dotenv()

True

In [418]:
dbid=os.getenv("dbid2")
dbpw=os.getenv("dbpw2")
host=os.getenv("host2")
port=os.getenv("port2")
dbname=os.getenv("dbname")

In [433]:
engine=create_engine(f"mysql+pymysql://{dbid}:{dbpw}@{host}:{port}/{dbname}")
conn=engine.connect()

In [434]:
passenger = pd.read_sql('p_info', con=conn)
ticket = pd.read_sql('t_info', con=conn)
survived = pd.read_sql("survived", con=conn)
passenger2 = pd.read_sql('passenger', con=conn)
ticket2 = pd.read_sql('ticket', con=conn)
survived2 = pd.read_sql("surv", con=conn)

conn.close()

In [425]:
passenger

,PassengerId,Name,Sex,Age,SibSp,Parch
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0
4,5,"Allen, Mr. William Henry",male,35.0,0,0
...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0,0
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0
890,891,"Dooley, Mr. Patrick",male,32.0,0,0

In [426]:
ticket

     PassengerId            Ticket  Pclass     Fare Cabin Embarked
0              1         A/5 21171       3   7.2500   NaN        S
1              2          PC 17599       1  71.2833   C85        C
2              3  STON/O2. 3101282       3   7.9250   NaN        S
3              4            113803       1  53.1000  C123        S
4              5            373450       3   8.0500   NaN        S
..           ...               ...     ...      ...   ...      ...
886          887            211536       2  13.0000   NaN        S
887          888            112053       1  30.0000   B42        S
888          889        W./C. 6607       3  23.4500   NaN        S
889          890            111369       1  30.0000  C148        C
890          891            370376       3   7.7500   NaN        Q

[891 rows x 6 columns]

In [427]:
survived

     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[891 rows x 2 columns]

# concat 
* 기준컬럼 없이 무조건 합침
* 기본값은 axis=0, 행 방향으로 합침
* 옆으로 붙이고 싶으면 axis=1
* outer join이 기본

In [428]:
print("passenger", passenger.shape)
print('ticket', ticket.shape)
print("survived", survived.shape)

passenger (891, 6)
ticket (891, 6)
survived (891, 2)

In [429]:
pd.concat([passenger, ticket])

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,NaN,NaN,NaN,NaN,NaN
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,NaN,NaN,NaN,NaN,NaN
2,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,NaN,NaN,NaN,NaN,NaN
4,5,"Allen, Mr. William Henry",male,35.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
886,887,NaN,NaN,NaN,NaN,NaN,211536,2.0,13.00,NaN,S
887,888,NaN,NaN,NaN,NaN,NaN,112053,1.0,30.00,B42,S
888,889,NaN,NaN,NaN,NaN,NaN,W./C. 6607,3.0,23.45,NaN,S
889,890,NaN,NaN,NaN,NaN,NaN,111369,1.0,30.00,C148,C
890,891,NaN,NaN,NaN,NaN,NaN,370376,3.0,7.75,NaN,Q

In [430]:
pd.concat([passenger, ticket], axis=1)

,PassengerId,Name,Sex,Age,SibSp,Parch,PassengerId,Ticket,Pclass,Fare,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,1,A/5 21171,3,7.2500,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,2,PC 17599,1,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,3,STON/O2. 3101282,3,7.9250,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,4,113803,1,53.1000,C123,S
4,5,"Allen, Mr. William Henry",male,35.0,0,0,5,373450,3,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0,0,887,211536,2,13.0000,NaN,S
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,888,112053,1,30.0000,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,889,W./C. 6607,3,23.4500,NaN,S
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0,890,111369,1,30.0000,C148,C
890,891,"Dooley, Mr. Patrick",male,32.0,0,0,891,370376,3,7.7500,NaN,Q

In [432]:
pd.concat([passenger, survived], axis=1)

,PassengerId,Name,Sex,Age,SibSp,Parch,PassengerId,Survived
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,1,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,2,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,3,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,4,1
4,5,"Allen, Mr. William Henry",male,35.0,0,0,5,0
...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0,0,887,0
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,888,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,889,0
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0,890,1
890,891,"Dooley, Mr. Patrick",male,32.0,0,0,891,0

# 인덱스가 섞여있는 데이터프레임 합치기

In [435]:
print("passenger2", passenger2.shape)
print('ticket2', ticket2.shape)
print("survived2", survived2.shape)

passenger2 (623, 6)
ticket2 (445, 6)
survived2 (446, 2)

In [436]:
pd.concat([passenger2, ticket2])

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1.0,0.0,NaN,NaN,NaN,NaN,NaN
1,192,"Carbines, Mr. William",male,19.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
2,715,"Greenberg, Mr. Samuel",male,52.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
3,533,"Elias, Mr. Joseph Jr",male,17.0,1.0,1.0,NaN,NaN,NaN,NaN,NaN
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1.0,0.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
440,692,NaN,NaN,NaN,NaN,NaN,349256,3.0,13.4167,NaN,C
441,585,NaN,NaN,NaN,NaN,NaN,3411,3.0,8.7125,NaN,C
442,265,NaN,NaN,NaN,NaN,NaN,382649,3.0,7.7500,NaN,Q
443,328,NaN,NaN,NaN,NaN,NaN,28551,2.0,13.0000,D,S
444,136,NaN,NaN,NaN,NaN,NaN,SC/PARIS 2133,2.0,15.0458,NaN,C

In [437]:
pd.concat([passenger2, ticket2], axis=1)

,PassengerId,Name,Sex,Age,SibSp,Parch,PassengerId,Ticket,Pclass,Fare,Cabin,Embarked
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,486.0,4133,3.0,25.4667,NaN,S
1,192,"Carbines, Mr. William",male,19.0,0,0,119.0,PC 17558,1.0,247.5208,B58 B60,C
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0,836.0,PC 17756,1.0,83.1583,E49,C
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1,528.0,PC 17483,1.0,221.7792,C95,S
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,396.0,350052,3.0,7.7958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
621,197,"Mernagh, Mr. Robert",male,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1,NaN,NaN,NaN,NaN,NaN,NaN

In [438]:
pd.concat([passenger2, survived2], axis=1)

,PassengerId,Name,Sex,Age,SibSp,Parch,PassengerId,Survived
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,762.0,0.0
1,192,"Carbines, Mr. William",male,19.0,0,0,665.0,1.0
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0,809.0,0.0
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1,332.0,0.0
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,21.0,0.0
...,...,...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0,NaN,NaN
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,NaN,NaN
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0,NaN,NaN
621,197,"Mernagh, Mr. Robert",male,NaN,0,0,NaN,NaN
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1,NaN,NaN

# merge
* inner join이 기본

In [439]:
passenger2.columns

Index(['PassengerId', 'Name', 'Sex', 'Age', 'SibSp', 'Parch'], dtype='str')

In [440]:
pd.merge(passenger2, ticket2, how='inner', on='PassengerId')

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
0,192,"Carbines, Mr. William",male,19.0,0,0,28424,2,13.0000,NaN,S
1,715,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,2,13.0000,NaN,S
2,533,"Elias, Mr. Joseph Jr",male,17.0,1,1,2690,3,7.2292,NaN,C
3,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,A/5. 3337,3,14.5000,NaN,S
4,597,"Leitch, Miss. Jessie Wills",female,NaN,0,0,248727,2,33.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
312,349,"Coutts, Master. William Loch ""William""",male,3.0,1,1,C.A. 37671,3,15.9000,NaN,S
313,616,"Herman, Miss. Alice",female,24.0,1,2,220845,2,65.0000,NaN,S
314,580,"Jussila, Mr. Eiriik",male,32.0,0,0,STON/O 2. 3101286,3,7.9250,NaN,S
315,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,3,7.6292,NaN,Q
316,176,"Klasen, Mr. Klas Albin",male,18.0,1,1,350404,3,7.8542,NaN,S

In [441]:
pd.merge(passenger2, ticket2, how='left', on='PassengerId')

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,NaN,NaN,NaN,NaN,NaN
1,192,"Carbines, Mr. William",male,19.0,0,0,28424,2.0,13.0000,NaN,S
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,2.0,13.0000,NaN,S
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1,2690,3.0,7.2292,NaN,C
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,A/5. 3337,3.0,14.5000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0,STON/O 2. 3101286,3.0,7.9250,NaN,S
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,3.0,7.6292,NaN,Q
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0,NaN,NaN,NaN,NaN,NaN
621,197,"Mernagh, Mr. Robert",male,NaN,0,0,NaN,NaN,NaN,NaN,NaN
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1,350404,3.0,7.8542,NaN,S

In [443]:
len(ticket2)

445

In [442]:
pd.merge(passenger2, ticket2, how='right', on='PassengerId')

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
0,486,NaN,NaN,NaN,NaN,NaN,4133,3,25.4667,NaN,S
1,119,"Baxter, Mr. Quigg Edmond",male,24.0,0.0,1.0,PC 17558,1,247.5208,B58 B60,C
2,836,NaN,NaN,NaN,NaN,NaN,PC 17756,1,83.1583,E49,C
3,528,"Farthing, Mr. John",male,NaN,0.0,0.0,PC 17483,1,221.7792,C95,S
4,396,"Johansson, Mr. Erik",male,22.0,0.0,0.0,350052,3,7.7958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
440,692,"Karun, Miss. Manca",female,4.0,0.0,1.0,349256,3,13.4167,NaN,C
441,585,"Paulner, Mr. Uscher",male,NaN,0.0,0.0,3411,3,8.7125,NaN,C
442,265,NaN,NaN,NaN,NaN,NaN,382649,3,7.7500,NaN,Q
443,328,NaN,NaN,NaN,NaN,NaN,28551,2,13.0000,D,S
444,136,"Richard, Mr. Emile",male,23.0,0.0,0.0,SC/PARIS 2133,2,15.0458,NaN,C

In [444]:
pd.merge(passenger2, ticket2, how='outer', on='PassengerId')

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,3.0,7.250,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,NaN,NaN,NaN,NaN,NaN
2,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,3.0,7.925,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,1.0,53.100,C123,S
4,5,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,3.0,8.050,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
746,885,NaN,NaN,NaN,NaN,NaN,SOTON/OQ 392076,3.0,7.050,NaN,S
747,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0.0,5.0,382652,3.0,29.125,NaN,Q
748,887,"Montvila, Rev. Juozas",male,27.0,0.0,0.0,211536,2.0,13.000,NaN,S
749,888,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,112053,1.0,30.000,B42,S
750,891,NaN,NaN,NaN,NaN,NaN,370376,3.0,7.750,NaN,Q

# join
* left_df.join(right_df)
* left_join이 기본

In [446]:
passenger2 = passenger2.set_index('PassengerId')
passenger2

,Name,Sex,Age,SibSp,Parch
PassengerId,,,,,
193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0
192,"Carbines, Mr. William",male,19.0,0,0
715,"Greenberg, Mr. Samuel",male,52.0,0,0
533,"Elias, Mr. Joseph Jr",male,17.0,1,1
133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0
...,...,...,...,...,...
580,"Jussila, Mr. Eiriik",male,32.0,0,0
503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0
538,"LeRoy, Miss. Bertha",female,30.0,0,0
197,"Mernagh, Mr. Robert",male,NaN,0,0
176,"Klasen, Mr. Klas Albin",male,18.0,1,1

In [447]:
ticket2 = ticket2.set_index('PassengerId')
ticket2

                    Ticket  Pclass      Fare    Cabin Embarked
PassengerId
486                   4133       3   25.4667      NaN        S
119               PC 17558       1  247.5208  B58 B60        C
836               PC 17756       1   83.1583      E49        C
528               PC 17483       1  221.7792      C95        S
396                 350052       3    7.7958      NaN        S
...                    ...     ...       ...      ...      ...
692                 349256       3   13.4167      NaN        C
585                   3411       3    8.7125      NaN        C
265                 382649       3    7.7500      NaN        Q
328                  28551       2   13.0000        D        S
136          SC/PARIS 2133       2   15.0458      NaN        C

[445 rows x 5 columns]

In [448]:
passenger2.join(ticket2)

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,NaN,NaN,NaN,NaN,NaN
192,"Carbines, Mr. William",male,19.0,0,0,28424,2.0,13.0000,NaN,S
715,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,2.0,13.0000,NaN,S
533,"Elias, Mr. Joseph Jr",male,17.0,1,1,2690,3.0,7.2292,NaN,C
133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,A/5. 3337,3.0,14.5000,NaN,S
...,...,...,...,...,...,...,...,...,...,...
580,"Jussila, Mr. Eiriik",male,32.0,0,0,STON/O 2. 3101286,3.0,7.9250,NaN,S
503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,3.0,7.6292,NaN,Q
538,"LeRoy, Miss. Bertha",female,30.0,0,0,NaN,NaN,NaN,NaN,NaN
197,"Mernagh, Mr. Robert",male,NaN,0,0,NaN,NaN,NaN,NaN,NaN
176,"Klasen, Mr. Klas Albin",male,18.0,1,1,350404,3.0,7.8542,NaN,S

# 중복여부 확인 및 제거하기

In [451]:
toss = pd.read_csv("./data/toss_reviews.csv", index_col=0)
toss

,사용자,별점,리뷰,날짜,개발자 응답
0,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
1,최유연,5,"증권부분이 너무 빈약해요. 이평선, 분봉, 틱봉 자유롭게 수치를 설정할 수 있었음 ...",2025년 1월 18일,"안녕하세요. 최유연 님, 토스팀입니다. 토스증권 사용하시면서 주신 소중한 의견 너무..."
2,EXPRESS,5,주식 UI에서 홈과 관심 종목을 나눈 것도 불편한데 이번 자주 사용하는 계좌 업데이...,2025년 2월 25일,"안녕하세요. EXPRESS 님, 토스팀입니다. 우선 토스증권 이용에 불편을 드려 죄..."
3,JS P,5,언제 한 번 대대적으로 앱 퍼포먼스 최적화를 했으면 좋겠습니다. 예전엔 이러지 않았...,2025년 2월 28일,"안녕하세요. JS P 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 노력하였..."
4,AndPeter,5,앱 최적화 좀 해주세요! 무슨 메모리를 1GB나 잡아먹고 패킷전송이 하루에 80만건...,2025년 3월 1일,"안녕하세요. AndPeter 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
...,...,...,...,...,...
57223,김민,5,"아니 업데이트 방금하니까, 주문수정하는게 가격 바꾸는게 안되네요? 무조건 취소하고 ...",2024년 11월 11일,"안녕하세요 김민님, 토스팀입니다. 우선 토스증권 서비스 이용에 불편을 드려 정말 죄..."
57224,최고운,5,업데이트 후 동영상 재생광고를 선택권없이 무조건 시청해야 하군요. wi-fi 환경이...,2023년 6월 3일,"안녕하세요. 최고운님. 토스 고객센터입니다. 먼저, 이용에 불편을 드려 죄송합니다...."
57225,블리,5,"라이브쇼핑보고,포인트받기 시스템 변경후,어찌 주구장창 1포인트만 나오는지.........",2024년 4월 11일,"안녕하세요. 블리님, 토스 고객센터입니다. 먼저 서비스 이용에 불편을 드렸다면 대단..."
57226,조명현,5,구석구석 숨어있던 버그를 잡다가 업데이트 설치가 안 되는 버그가 생긴 듯 합니다,2025년 2월 25일,"안녕하세요. 조명현 님, 토스팀입니다. 사용에 불편을 드린것 같아 마음이 무겁습니다..."
57227,이예진,5,홈화면에 계좌 순서 설정한게 반영 안되게 바뀌었는지 이해가 안감 너무 불편함,2025년 2월 27일,"안녕하세요. 이예진 님, 토스팀입니다. 토스를 이용하시면서 느끼신 소중한 의견을 주..."

In [453]:
toss[toss['사용자']=='Won Choi']

,사용자,별점,리뷰,날짜,개발자 응답
0,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
20,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
40,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
60,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
80,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
...,...,...,...,...,...
54642,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
55156,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
55670,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
56184,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
56698,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."

# 중복여부 확인 및 제거하기
* duplicated().sum() : 중복이 있는 데이터 개수
* drop_duplicates() : 중복 행 제거

In [454]:
toss.duplicated().sum()

np.int64(56698)

In [456]:
toss = toss.drop_duplicates()
toss

,사용자,별점,리뷰,날짜,개발자 응답
0,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
1,최유연,5,"증권부분이 너무 빈약해요. 이평선, 분봉, 틱봉 자유롭게 수치를 설정할 수 있었음 ...",2025년 1월 18일,"안녕하세요. 최유연 님, 토스팀입니다. 토스증권 사용하시면서 주신 소중한 의견 너무..."
2,EXPRESS,5,주식 UI에서 홈과 관심 종목을 나눈 것도 불편한데 이번 자주 사용하는 계좌 업데이...,2025년 2월 25일,"안녕하세요. EXPRESS 님, 토스팀입니다. 우선 토스증권 이용에 불편을 드려 죄..."
3,JS P,5,언제 한 번 대대적으로 앱 퍼포먼스 최적화를 했으면 좋겠습니다. 예전엔 이러지 않았...,2025년 2월 28일,"안녕하세요. JS P 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 노력하였..."
4,AndPeter,5,앱 최적화 좀 해주세요! 무슨 메모리를 1GB나 잡아먹고 패킷전송이 하루에 80만건...,2025년 3월 1일,"안녕하세요. AndPeter 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
...,...,...,...,...,...
57223,김민,5,"아니 업데이트 방금하니까, 주문수정하는게 가격 바꾸는게 안되네요? 무조건 취소하고 ...",2024년 11월 11일,"안녕하세요 김민님, 토스팀입니다. 우선 토스증권 서비스 이용에 불편을 드려 정말 죄..."
57224,최고운,5,업데이트 후 동영상 재생광고를 선택권없이 무조건 시청해야 하군요. wi-fi 환경이...,2023년 6월 3일,"안녕하세요. 최고운님. 토스 고객센터입니다. 먼저, 이용에 불편을 드려 죄송합니다...."
57225,블리,5,"라이브쇼핑보고,포인트받기 시스템 변경후,어찌 주구장창 1포인트만 나오는지.........",2024년 4월 11일,"안녕하세요. 블리님, 토스 고객센터입니다. 먼저 서비스 이용에 불편을 드렸다면 대단..."
57226,조명현,5,구석구석 숨어있던 버그를 잡다가 업데이트 설치가 안 되는 버그가 생긴 듯 합니다,2025년 2월 25일,"안녕하세요. 조명현 님, 토스팀입니다. 사용에 불편을 드린것 같아 마음이 무겁습니다..."
57227,이예진,5,홈화면에 계좌 순서 설정한게 반영 안되게 바뀌었는지 이해가 안감 너무 불편함,2025년 2월 27일,"안녕하세요. 이예진 님, 토스팀입니다. 토스를 이용하시면서 느끼신 소중한 의견을 주..."

In [459]:
toss=toss.reset_index(drop=True)
toss

,사용자,별점,리뷰,날짜,개발자 응답
0,Won Choi,5,토스 많이 이용하는데 나쁘지 않음. 하지만 연말정산 잘 알지 않으면 돌려받기는 사용...,2024년 11월 19일,"안녕하세요. Won Choi 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
1,최유연,5,"증권부분이 너무 빈약해요. 이평선, 분봉, 틱봉 자유롭게 수치를 설정할 수 있었음 ...",2025년 1월 18일,"안녕하세요. 최유연 님, 토스팀입니다. 토스증권 사용하시면서 주신 소중한 의견 너무..."
2,EXPRESS,5,주식 UI에서 홈과 관심 종목을 나눈 것도 불편한데 이번 자주 사용하는 계좌 업데이...,2025년 2월 25일,"안녕하세요. EXPRESS 님, 토스팀입니다. 우선 토스증권 이용에 불편을 드려 죄..."
3,JS P,5,언제 한 번 대대적으로 앱 퍼포먼스 최적화를 했으면 좋겠습니다. 예전엔 이러지 않았...,2025년 2월 28일,"안녕하세요. JS P 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 노력하였..."
4,AndPeter,5,앱 최적화 좀 해주세요! 무슨 메모리를 1GB나 잡아먹고 패킷전송이 하루에 80만건...,2025년 3월 1일,"안녕하세요. AndPeter 님, 토스팀입니다. 만족스러운 서비스를 제공하기 위해 ..."
...,...,...,...,...,...
525,김민,5,"아니 업데이트 방금하니까, 주문수정하는게 가격 바꾸는게 안되네요? 무조건 취소하고 ...",2024년 11월 11일,"안녕하세요 김민님, 토스팀입니다. 우선 토스증권 서비스 이용에 불편을 드려 정말 죄..."
526,최고운,5,업데이트 후 동영상 재생광고를 선택권없이 무조건 시청해야 하군요. wi-fi 환경이...,2023년 6월 3일,"안녕하세요. 최고운님. 토스 고객센터입니다. 먼저, 이용에 불편을 드려 죄송합니다...."
527,블리,5,"라이브쇼핑보고,포인트받기 시스템 변경후,어찌 주구장창 1포인트만 나오는지.........",2024년 4월 11일,"안녕하세요. 블리님, 토스 고객센터입니다. 먼저 서비스 이용에 불편을 드렸다면 대단..."
528,조명현,5,구석구석 숨어있던 버그를 잡다가 업데이트 설치가 안 되는 버그가 생긴 듯 합니다,2025년 2월 25일,"안녕하세요. 조명현 님, 토스팀입니다. 사용에 불편을 드린것 같아 마음이 무겁습니다..."
529,이예진,5,홈화면에 계좌 순서 설정한게 반영 안되게 바뀌었는지 이해가 안감 너무 불편함,2025년 2월 27일,"안녕하세요. 이예진 님, 토스팀입니다. 토스를 이용하시면서 느끼신 소중한 의견을 주..."